SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy7.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy7.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7.bootloader.OSCCFG=0x01
atxy7.bootloader.TCD0CFG_avrdude=
atxy7.bootloader.TCD0CFG_serialupdi=
atxy7.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy7.bootloader.APPEND=0x00
atxy7.bootloader.BOOTEND=0x00
atxy7.bootloader.resetpinbits=01
atxy7.bootloader.avrdudestring=
atxy7.bootloader.serialupdistring=-aerase
atxy7.bootloader.altreset=Alt reset pin not supported on 0/1-series.
atxy7.bootloader.tool=avrdude
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy7.build.bootload=
atxy7.build.printfabr=
atxy7.build.attachabr=
atxy7.build.wireabr=
atxy7.build.pwmabr=6A
#atxy7.build.optabr=.Os

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy7.upload.tool=avrdude
atxy7.upload.workaround=
atxy7.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 24-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy7.menu.chip.3227=ATtiny3227
atxy7.menu.chip.3227.bootloader.altreset=11
atxy7.menu.chip.3227.build.board=AVR_ATtiny3227
atxy7.menu.chip.3227.build.millistimer=B1
atxy7.menu.chip.3227.build.attiny=3227
atxy7.menu.chip.3227.upload.maximum_size=32768
atxy7.menu.chip.3227.upload.maximum_data_size=3072
atxy7.menu.chip.3227.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy7.menu.chip.3217=ATtiny3217
atxy7.menu.chip.3217.build.board=AVR_ATtiny3217
atxy7.menu.chip.3217.build.attiny=3217
atxy7.menu.chip.3217.upload.maximum_size=32768
atxy7.menu.chip.3217.upload.maximum_data_size=2048
atxy7.menu.chip.3217.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7.menu.chip.3217.bootloader.TCD0CFG_serialupdi=4:0x00
atxy7.menu.chip.1627=ATtiny1627
atxy7.menu.chip.1627.bootloader.altreset=11
atxy7.menu.chip.1627.build.board=AVR_ATtiny1627
atxy7.menu.chip.1627.build.millistimer=B1
atxy7.menu.chip.1627.build.attiny=1627
atxy7.menu.chip.1627.upload.maximum_size=16384
atxy7.menu.chip.1627.upload.maximum_data_size=2048
atxy7.menu.chip.1627.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy7.menu.chip.1617=ATtiny1617
atxy7.menu.chip.1617.build.board=AVR_ATtiny1617
atxy7.menu.chip.1617.build.attiny=1617
atxy7.menu.chip.1617.upload.maximum_size=16384
atxy7.menu.chip.1617.upload.maximum_data_size=2048
atxy7.menu.chip.1617.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7.menu.chip.1617.bootloader.TCD0CFG_serialupdi=4:0x00
atxy7.menu.chip.1607=ATtiny1607
atxy7.menu.chip.1607.build.board=AVR_ATtiny1607
atxy7.menu.chip.1607.build.attiny=1607
atxy7.menu.chip.1607.build.millistimer=A0
atxy7.menu.chip.1607.upload.maximum_size=16384
atxy7.menu.chip.1607.upload.maximum_data_size=1024
atxy7.menu.chip.827=ATtiny827
atxy7.menu.chip.827.bootloader.altreset=11
atxy7.menu.chip.827.build.board=AVR_ATtiny827
atxy7.menu.chip.827.build.millistimer=B1
atxy7.menu.chip.827.build.attiny=827
atxy7.menu.chip.827.upload.maximum_size=8192
atxy7.menu.chip.827.build.mrelax=
atxy7.menu.chip.827.upload.maximum_data_size=1024
atxy7.menu.chip.827.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy7.menu.chip.817=ATtiny817
atxy7.menu.chip.817.build.board=AVR_ATtiny817
atxy7.menu.chip.817.build.attiny=817
atxy7.menu.chip.817.upload.maximum_size=8192
atxy7.menu.chip.817.build.mrelax=
atxy7.menu.chip.817.upload.maximum_data_size=512
atxy7.menu.chip.817.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7.menu.chip.817.bootloader.TCD0CFG_serialupdi=4:0x00
atxy7.menu.chip.807=ATtiny807
atxy7.menu.chip.807.build.board=AVR_ATtiny807
atxy7.menu.chip.807.build.attiny=807
atxy7.menu.chip.807.build.millistimer=A0
atxy7.menu.chip.807.upload.maximum_size=8192
atxy7.menu.chip.807.build.mrelax=
atxy7.menu.chip.807.upload.maximum_data_size=512
atxy7.menu.chip.427=ATtiny427
atxy7.menu.chip.427.bootloader.altreset=11
atxy7.menu.chip.427.build.board=AVR_ATtiny427
atxy7.menu.chip.427.build.millistimer=B1
atxy7.menu.chip.427.build.attiny=427
atxy7.menu.chip.427.upload.maximum_size=4096
atxy7.menu.chip.427.build.mrelax=
atxy7.menu.chip.427.upload.maximum_data_size=512
atxy7.menu.chip.427.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy7.menu.chip.417=ATtiny417
atxy7.menu.chip.417.build.board=AVR_ATtiny417
atxy7.menu.chip.417.build.attiny=417
atxy7.menu.chip.417.upload.maximum_size=4096
atxy7.menu.chip.417.build.mrelax=
atxy7.menu.chip.417.upload.maximum_data_size=256
atxy7.menu.chip.417.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7.menu.chip.417.bootloader.TCD0CFG_serialupdi=4:0x00

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy7.menu.clock.20internal=20 MHz internal
atxy7.menu.clock.16internal=16 MHz internal
atxy7.menu.clock.10internal=10 MHz internal
atxy7.menu.clock.8internal=8 MHz internal
atxy7.menu.clock.5internal=5 MHz internal
atxy7.menu.clock.4internal=4 MHz internal
atxy7.menu.clock.2internal=2 MHz internal
atxy7.menu.clock.1internal=1 MHz internal
atxy7.menu.clock.20internaltuned=20 MHz internal - tuned
atxy7.menu.clock.16internaltuned=16 MHz internal - tuned
atxy7.menu.clock.12internaltuned=12 MHz internal - tuned
atxy7.menu.clock.10internaltuned=10 MHz internal - tuned
atxy7.menu.clock.8internaltuned=8 MHz internal - tuned
atxy7.menu.clock.6internaltuned=6 MHz internal - tuned
atxy7.menu.clock.5internaltuned=5 MHz internal - tuned
atxy7.menu.clock.4internaltuned=4 MHz internal - tuned
atxy7.menu.clock.2internaltuned=2 MHz internal - tuned
atxy7.menu.clock.1internaltuned=1 MHz internal - tuned
atxy7.menu.clock.20extclock=20 MHz external clock
atxy7.menu.clock.16extclock=16 MHz external clock
atxy7.menu.clock.12extclock=12 MHz external clock
atxy7.menu.clock.10extclock=10 MHz external clock
atxy7.menu.clock.8extclock=8 MHz external clock
atxy7.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy7.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy7.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy7.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy7.menu.clock.24extclock=24 MHz external clock - overclocked
atxy7.menu.clock.25extclock=25 MHz external clock - overclocked
atxy7.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy7.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy7.menu.clock.20internal.build.speed=20
atxy7.menu.clock.20internal.build.clocksource=0
atxy7.menu.clock.16internal.build.speed=16
atxy7.menu.clock.16internal.build.clocksource=0
atxy7.menu.clock.10internal.build.speed=10
atxy7.menu.clock.10internal.build.clocksource=0
atxy7.menu.clock.8internal.build.speed=8
atxy7.menu.clock.8internal.build.clocksource=0
atxy7.menu.clock.5internal.build.speed=5
atxy7.menu.clock.5internal.build.clocksource=0
atxy7.menu.clock.4internal.build.speed=4
atxy7.menu.clock.4internal.build.clocksource=0
atxy7.menu.clock.2internal.build.speed=2
atxy7.menu.clock.2internal.build.clocksource=0
atxy7.menu.clock.1internal.build.speed=1
atxy7.menu.clock.1internal.build.clocksource=0
atxy7.menu.clock.20extclock.build.speed=20
atxy7.menu.clock.20extclock.build.clocksource=2
atxy7.menu.clock.16extclock.build.speed=16
atxy7.menu.clock.16extclock.build.clocksource=2
atxy7.menu.clock.12extclock.build.speed=12
atxy7.menu.clock.12extclock.build.clocksource=2
atxy7.menu.clock.10extclock.build.speed=10
atxy7.menu.clock.10extclock.build.clocksource=2
atxy7.menu.clock.8extclock.build.speed=8
atxy7.menu.clock.8extclock.build.clocksource=2
atxy7.menu.clock.24extclock.build.speed=24
atxy7.menu.clock.24extclock.build.clocksource=2
atxy7.menu.clock.25extclock.build.speed=24
atxy7.menu.clock.25extclock.build.clocksource=2
atxy7.menu.clock.30extclock.build.speed=30
atxy7.menu.clock.30extclock.build.clocksource=2
atxy7.menu.clock.32extclock.build.speed=32
atxy7.menu.clock.32extclock.build.clocksource=2
atxy7.menu.clock.1internaltuned.build.speed=1
atxy7.menu.clock.1internaltuned.build.clocksource=0
atxy7.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.2internaltuned.build.speed=2
atxy7.menu.clock.2internaltuned.build.clocksource=0
atxy7.menu.clock.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.4internaltuned.build.speed=4
atxy7.menu.clock.4internaltuned.build.clocksource=0
atxy7.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.5internaltuned.build.speed=5
atxy7.menu.clock.5internaltuned.build.clocksource=0
atxy7.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.6internaltuned.build.speed=6
atxy7.menu.clock.6internaltuned.build.clocksource=0
atxy7.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.8internaltuned.build.speed=8
atxy7.menu.clock.8internaltuned.build.clocksource=0
atxy7.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.10internaltuned.build.speed=10
atxy7.menu.clock.10internaltuned.build.clocksource=0
atxy7.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.12internaltuned.build.speed=12
atxy7.menu.clock.12internaltuned.build.clocksource=0
atxy7.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.12internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.16internaltuned.build.speed=16
atxy7.menu.clock.16internaltuned.build.clocksource=0
atxy7.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.20internaltuned.build.speed=20
atxy7.menu.clock.20internaltuned.build.clocksource=0
atxy7.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.24internaltuned.build.speed=24
atxy7.menu.clock.24internaltuned.build.clocksource=0
atxy7.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.25internaltuned.build.speed=25
atxy7.menu.clock.25internaltuned.build.clocksource=0
atxy7.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.30internaltuned.build.speed=30
atxy7.menu.clock.30internaltuned.build.clocksource=0
atxy7.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.32internaltuned.build.speed=32
atxy7.menu.clock.32internaltuned.build.clocksource=0
atxy7.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy7.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atxy7.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy7.menu.clock.5internal.bootloader.OSCCFG=0x02

