SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy7.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy7.menu.printf.full=Full, 2.6k, prints floats
atxy7.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy7.menu.printf.full.build.printfabr=.pfF
atxy7.menu.printf.minimal=Minimal, 1.1k flash used
atxy7.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy7.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy7.menu.PWMmux.A_default=PB0-2, PA3-5, 1-series: PC0/1 (default)
atxy7.menu.PWMmux.default=PB0-2, PA3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.A_buffered=PB0-2 (buffered), 1-series: PC0/1
atxy7.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy7.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy7.menu.PWMmux.U6_A=PB0,1,5, PA3-5, 1-series: PC0/1
atxy7.menu.PWMmux.U6=PB0,1,5, PA3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.C6_D=PB0-2, PC3-5 1-series: PA4/5
atxy7.menu.PWMmux.C6_A=PB0-2, PC3-5 1-series: PC0/1
atxy7.menu.PWMmux.C6=PB0-2, PC3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.UC6_D=PB0,1,5, PC3-5, 1-series: PA4/5
atxy7.menu.PWMmux.UC6_A=PB0,1,5, PC3-5, 1-series: PC0/1
atxy7.menu.PWMmux.UC6=PB0,1,5, PC3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.U3_D=PB0,1,5 (buffered), 1-series: PA4/5
atxy7.menu.PWMmux.U3_A=PB0,1,5 (buffered), 1-series: PC0/1
atxy7.menu.PWMmux.U3=PB0,1,5 (buffered). No TCD PWM even on 1-series.
atxy7.menu.PWMmux.I6_A=PB3-5 PA3-5, 1-series: PC0/1
atxy7.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.IC6_D=PB3-5, PC3-5, 1-series: PA4/5
atxy7.menu.PWMmux.IC6_A=PB3-5, PC3-5, 1-series: PC0/1
atxy7.menu.PWMmux.IC6=PB3-5, PC3-5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy7.menu.PWMmux.I3_A=PB3-5 (buffered), 1-series: PC0/1
atxy7.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy7.menu.PWMmux.SC6_A=PB3-5, PC3, PA4/5, 1-series: PC0/1
atxy7.menu.PWMmux.SC6=PB3-5, PC3, PA4/5. No TCD PWM even on 1-series.
atxy7.menu.PWMmux.A_default.build.pwmflags=-DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.A_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.U6_A.build.pwmflags=-DTCA_PORTMUX=0x04 -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atxy7.menu.PWMmux.C6_D.build.pwmflags=-DTCA_PORTMUX=0x38 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7.menu.PWMmux.C6_A.build.pwmflags=-DTCA_PORTMUX=0x38 -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.C6.build.pwmflags=-DTCA_PORTMUX=0x38
atxy7.menu.PWMmux.UC6_D.build.pwmflags=-DTCA_PORTMUX=0x3C -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7.menu.PWMmux.UC6_A.build.pwmflags=-DTCA_PORTMUX=0x3C -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.UC6.build.pwmflags=-DTCA_PORTMUX=0x3C
atxy7.menu.PWMmux.U3_D.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.U3_A.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.I6_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy7.menu.PWMmux.IC6_D.build.pwmflags=-DTCA_PORTMUX=0x3F -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7.menu.PWMmux.IC6_A.build.pwmflags=-DTCA_PORTMUX=0x3F -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.IC6.build.pwmflags=-DTCA_PORTMUX=0x3F
atxy7.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.I3_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy7.menu.PWMmux.SC6_A.build.pwmflags=-DTCA_PORTMUX=0x0F -DUSE_TIMERD0_PWM
atxy7.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atxy7.menu.PWMmux.A_default.build.pwmabr=6A
atxy7.menu.PWMmux.default.build.pwmabr=6
atxy7.menu.PWMmux.A_buffered.build.pwmabr=3A
atxy7.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy7.menu.PWMmux.buffered.build.pwmabr=3
atxy7.menu.PWMmux.U6_A.build.pwmabr=U6A
atxy7.menu.PWMmux.U6.build.pwmabr=U6
atxy7.menu.PWMmux.C6_D.build.pwmabr=C6D
atxy7.menu.PWMmux.C6_A.build.pwmabr=C6A
atxy7.menu.PWMmux.C6.build.pwmabr=C6
atxy7.menu.PWMmux.UC6_D.build.pwmabr=UC6D
atxy7.menu.PWMmux.UC6_A.build.pwmabr=UC6A
atxy7.menu.PWMmux.UC6.build.pwmabr=UC6
atxy7.menu.PWMmux.U3_D.build.pwmabr=U3D
atxy7.menu.PWMmux.U3_A.build.pwmabr=U3A
atxy7.menu.PWMmux.U3.build.pwmabr=U3
atxy7.menu.PWMmux.I6_A.build.pwmabr=I6A
atxy7.menu.PWMmux.I6.build.pwmabr=I6
atxy7.menu.PWMmux.IC6_D.build.pwmabr=IC6D
atxy7.menu.PWMmux.IC6_A.build.pwmabr=IC6A
atxy7.menu.PWMmux.IC6.build.pwmabr=IC6
atxy7.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy7.menu.PWMmux.I3_A.build.pwmabr=I3A
atxy7.menu.PWMmux.I3.build.pwmabr=I3
atxy7.menu.PWMmux.SC6_A.build.pwmabr=SC6A
atxy7.menu.PWMmux.SC6.build.pwmabr=SC6


#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy7.menu.attach.allenabled=On all pins, new implementation.
atxy7.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy7.menu.attach.manual=Only enabled ports
atxy7.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy7.menu.attach.oldversion=Old version, may fix bugs.
atxy7.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy7.menu.attach.manual.build.attachabr=.aMan
atxy7.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy7.menu.WDTtimeout.disabled=Disabled (recommended)
atxy7.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy7.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy7.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy7.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy7.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy7.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy7.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy7.menu.WDTwindow.disabled=No delay before window "opens"
atxy7.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy7.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy7.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy7.menu.WDTwindow.1second=1 Second before window "opens"
atxy7.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy7.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy7.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy7.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy7.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy7.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy7.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy7.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy7.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy7.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy7.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy7.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy7.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy7.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy7.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy7.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy7.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy7.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy7.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy7.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy7.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#  Non-bootloader                                                        #
#                                ##    ###      ####   ###  #   #      ###
#  ATtiny3226/3216              #  #  #   #     #   #   #   ##  #    #####
#  ATtiny1626/1616/1606           #   #   # === ####    #   # # #  #######
#  ATtiny826/816/806             #    #   #     #       #   #  ##    #####
#  ATtiny427/416/406            ####   ###      #      ###  #   #      ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy6.build.text_section_start=.text=0x0
atxy6.build.millistimer=D0
atxy6.build.board=AVR_ATtinyxy6
atxy6.build.clocksource=0
atxy6.build.core=megatinycore
atxy6.build.mrelax= -mrelax
atxy6.build.variant=txy6
#atxy6.build.optimizationlevel=-Os
atxy6.build.gcse=
atxy6.build.tuned=
atxy6.build.printf=
atxy6.build.wire=MORS
atxy6.build.attachmode=-DCORE_ATTACH_ALL
atxy6.build.mcu=attiny{build.attiny}
atxy6.build.f_cpu={build.speed}000000L
atxy6.build.extra_flags=-DARDUINO_attinyxy6 {build.tuned}
atxy6.build.export_merged_output=false
atxy6.build.pwmflags=-DUSE_TIMERD0_PWM

