SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy6.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy6.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy6.bootloader.OSCCFG=0x01
atxy6.bootloader.TCD0CFG_avrdude=
atxy6.bootloader.TCD0CFG_serialupdi=
atxy6.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy6.bootloader.APPEND=0x00
atxy6.bootloader.BOOTEND=0x00
atxy6.bootloader.resetpinbits=01
atxy6.bootloader.avrdudestring=
atxy6.bootloader.serialupdistring=-aerase
atxy6.bootloader.altreset=Alt reset pin not supported on 0/1-series.
atxy6.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy6.build.bootload=
atxy6.build.printfabr=
atxy6.build.attachabr=
atxy6.build.wireabr=
atxy6.build.pwmabr=6
#atxy6.build.optabr=.Os

#----------------------------------------#
# ALL UPLOADING VIA UPDI                 #
#________________________________________#
atxy6.upload.tool=avrdude
atxy6.upload.workaround=
atxy6.upload.prog_interlock=

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 20-pin 0/1-series tinyAVR submenus          #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy6.menu.chip.3226=ATtiny3226
atxy6.menu.chip.3226.bootloader.altreset=11
atxy6.menu.chip.3226.build.board=AVR_ATtiny3226
atxy6.menu.chip.3226.build.millistimer=B1
atxy6.menu.chip.3226.build.attiny=3226
atxy6.menu.chip.3226.upload.maximum_size=32768
atxy6.menu.chip.3226.upload.maximum_data_size=3072
atxy6.menu.chip.3226.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.3216=ATtiny3216
atxy6.menu.chip.3216.build.board=AVR_ATtiny3216
atxy6.menu.chip.3216.build.attiny=3216
atxy6.menu.chip.3216.upload.maximum_size=32768
atxy6.menu.chip.3216.upload.maximum_data_size=2048
atxy6.menu.chip.3216.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.3216.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.1626=ATtiny1626
atxy6.menu.chip.1626.bootloader.altreset=11
atxy6.menu.chip.1626.build.board=AVR_ATtiny1626
atxy6.menu.chip.1626.build.millistimer=B1
atxy6.menu.chip.1626.build.attiny=1626
atxy6.menu.chip.1626.upload.maximum_size=16384
atxy6.menu.chip.1626.upload.maximum_data_size=2048
atxy6.menu.chip.1626.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.1616=ATtiny1616
atxy6.menu.chip.1616.build.board=AVR_ATtiny1616
atxy6.menu.chip.1616.build.attiny=1616
atxy6.menu.chip.1616.upload.maximum_size=16384
atxy6.menu.chip.1616.upload.maximum_data_size=2048
atxy6.menu.chip.1616.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.1616.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.1606=ATtiny1606
atxy6.menu.chip.1606.build.board=AVR_ATtiny1606
atxy6.menu.chip.1606.build.attiny=1606
atxy6.menu.chip.1606.build.millistimer=A0
atxy6.menu.chip.1606.upload.maximum_size=16384
atxy6.menu.chip.1606.upload.maximum_data_size=1024
atxy6.menu.chip.826=ATtiny826
atxy6.menu.chip.826.bootloader.altreset=11
atxy6.menu.chip.826.build.board=AVR_ATtiny826
atxy6.menu.chip.826.build.millistimer=B1
atxy6.menu.chip.826.build.attiny=826
atxy6.menu.chip.826.upload.maximum_size=8192
atxy6.menu.chip.826.build.mrelax=
atxy6.menu.chip.826.upload.maximum_data_size=1024
atxy6.menu.chip.826.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.816=ATtiny816
atxy6.menu.chip.816.build.board=AVR_ATtiny816
atxy6.menu.chip.816.build.attiny=816
atxy6.menu.chip.816.upload.maximum_size=8192
atxy6.menu.chip.816.build.mrelax=
atxy6.menu.chip.816.upload.maximum_data_size=512
atxy6.menu.chip.816.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.816.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.806=ATtiny806
atxy6.menu.chip.806.build.board=AVR_ATtiny806
atxy6.menu.chip.806.build.attiny=806
atxy6.menu.chip.806.build.millistimer=A0
atxy6.menu.chip.806.upload.maximum_size=8192
atxy6.menu.chip.806.build.mrelax=
atxy6.menu.chip.806.upload.maximum_data_size=512
atxy6.menu.chip.426=ATtiny426
atxy6.menu.chip.426.bootloader.altreset=11
atxy6.menu.chip.426.build.board=AVR_ATtiny426
atxy6.menu.chip.426.build.millistimer=B1
atxy6.menu.chip.426.build.attiny=426
atxy6.menu.chip.426.upload.maximum_size=4096
atxy6.menu.chip.426.build.mrelax=
atxy6.menu.chip.426.upload.maximum_data_size=512
atxy6.menu.chip.426.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}1{bootloader.eesavebit}
atxy6.menu.chip.416=ATtiny416
atxy6.menu.chip.416.build.board=AVR_ATtiny416
atxy6.menu.chip.416.build.attiny=416
atxy6.menu.chip.416.upload.maximum_size=4096
atxy6.menu.chip.416.build.mrelax=
atxy6.menu.chip.416.upload.maximum_data_size=256
atxy6.menu.chip.416.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy6.menu.chip.416.bootloader.TCD0CFG_serialupdi=4:0x00
atxy6.menu.chip.406=ATtiny406
atxy6.menu.chip.406.build.board=AVR_ATtiny406
atxy6.menu.chip.406.build.attiny=406
atxy6.menu.chip.406.build.millistimer=A0
atxy6.menu.chip.406.upload.maximum_size=4096
atxy6.menu.chip.406.build.mrelax=
atxy6.menu.chip.406.upload.maximum_data_size=256

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy6.menu.clock.20internal=20 MHz internal
atxy6.menu.clock.16internal=16 MHz internal
atxy6.menu.clock.10internal=10 MHz internal
atxy6.menu.clock.8internal=8 MHz internal
atxy6.menu.clock.5internal=5 MHz internal
atxy6.menu.clock.4internal=4 MHz internal
atxy6.menu.clock.2internal=2 MHz internal
atxy6.menu.clock.1internal=1 MHz internal
atxy6.menu.clock.20internaltuned=20 MHz internal - tuned
atxy6.menu.clock.16internaltuned=16 MHz internal - tuned
atxy6.menu.clock.12internaltuned=12 MHz internal - tuned
atxy6.menu.clock.10internaltuned=10 MHz internal - tuned
atxy6.menu.clock.8internaltuned=8 MHz internal - tuned
atxy6.menu.clock.6internaltuned=6 MHz internal - tuned
atxy6.menu.clock.5internaltuned=5 MHz internal - tuned
atxy6.menu.clock.4internaltuned=4 MHz internal - tuned
atxy6.menu.clock.1internaltuned=1 MHz internal - tuned
atxy6.menu.clock.20extclock=20 MHz external clock
atxy6.menu.clock.16extclock=16 MHz external clock
atxy6.menu.clock.12extclock=12 MHz external clock
atxy6.menu.clock.10extclock=10 MHz external clock
atxy6.menu.clock.8extclock=8 MHz external clock
atxy6.menu.clock.24internaltuned=24 MHz internal - tuned, overclocked
atxy6.menu.clock.25internaltuned=25 MHz internal - tuned, overclocked
atxy6.menu.clock.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy6.menu.clock.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy6.menu.clock.24extclock=24 MHz external clock - overclocked
atxy6.menu.clock.25extclock=25 MHz external clock - overclocked
atxy6.menu.clock.30extclock=30 MHz external clock - overclocked, may be unstable
atxy6.menu.clock.32extclock=32 MHz external clock - overclocked, may be unstable
atxy6.menu.clock.20internal.build.speed=20
atxy6.menu.clock.20internal.build.clocksource=0
atxy6.menu.clock.16internal.build.speed=16
atxy6.menu.clock.16internal.build.clocksource=0
atxy6.menu.clock.10internal.build.speed=10
atxy6.menu.clock.10internal.build.clocksource=0
atxy6.menu.clock.8internal.build.speed=8
atxy6.menu.clock.8internal.build.clocksource=0
atxy6.menu.clock.5internal.build.speed=5
atxy6.menu.clock.5internal.build.clocksource=0
atxy6.menu.clock.4internal.build.speed=4
atxy6.menu.clock.4internal.build.clocksource=0
atxy6.menu.clock.2internal.build.speed=2
atxy6.menu.clock.2internal.build.clocksource=0
atxy6.menu.clock.1internal.build.speed=1
atxy6.menu.clock.1internal.build.clocksource=0
atxy6.menu.clock.20extclock.build.speed=20
atxy6.menu.clock.20extclock.build.clocksource=2
atxy6.menu.clock.16extclock.build.speed=16
atxy6.menu.clock.16extclock.build.clocksource=2
atxy6.menu.clock.12extclock.build.speed=12
atxy6.menu.clock.12extclock.build.clocksource=2
atxy6.menu.clock.10extclock.build.speed=10
atxy6.menu.clock.10extclock.build.clocksource=2
atxy6.menu.clock.8extclock.build.speed=8
atxy6.menu.clock.8extclock.build.clocksource=2
atxy6.menu.clock.24extclock.build.speed=24
atxy6.menu.clock.24extclock.build.clocksource=2
atxy6.menu.clock.25extclock.build.speed=24
atxy6.menu.clock.25extclock.build.clocksource=2
atxy6.menu.clock.30extclock.build.speed=30
atxy6.menu.clock.30extclock.build.clocksource=2
atxy6.menu.clock.32extclock.build.speed=32
atxy6.menu.clock.32extclock.build.clocksource=2
atxy6.menu.clock.20internaltuned.build.speed=20
atxy6.menu.clock.20internaltuned.build.clocksource=0
atxy6.menu.clock.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.16internaltuned.build.speed=16
atxy6.menu.clock.16internaltuned.build.clocksource=0
atxy6.menu.clock.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.12internaltuned.build.speed=12
atxy6.menu.clock.12internaltuned.build.clocksource=0
atxy6.menu.clock.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.24internaltuned.build.speed=24
atxy6.menu.clock.24internaltuned.build.clocksource=0
atxy6.menu.clock.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.25internaltuned.build.speed=25
atxy6.menu.clock.25internaltuned.build.clocksource=0
atxy6.menu.clock.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.30internaltuned.build.speed=30
atxy6.menu.clock.30internaltuned.build.clocksource=0
atxy6.menu.clock.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.32internaltuned.build.speed=32
atxy6.menu.clock.32internaltuned.build.clocksource=0
atxy6.menu.clock.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.10internaltuned.build.speed=10
atxy6.menu.clock.10internaltuned.build.clocksource=0
atxy6.menu.clock.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.8internaltuned.build.speed=8
atxy6.menu.clock.8internaltuned.build.clocksource=0
atxy6.menu.clock.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.6internaltuned.build.speed=6
atxy6.menu.clock.6internaltuned.build.clocksource=0
atxy6.menu.clock.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.5internaltuned.build.speed=5
atxy6.menu.clock.5internaltuned.build.clocksource=0
atxy6.menu.clock.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.4internaltuned.build.speed=4
atxy6.menu.clock.4internaltuned.build.clocksource=0
atxy6.menu.clock.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.1internaltuned.build.speed=1
atxy6.menu.clock.1internaltuned.build.clocksource=0
atxy6.menu.clock.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy6.menu.clock.20internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.12internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.10internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.6internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.5internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.24internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.25internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.30internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.32internaltuned.bootloader.OSCCFG=0x02
atxy6.menu.clock.20internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.10internal.bootloader.OSCCFG=0x02
atxy6.menu.clock.5internal.bootloader.OSCCFG=0x02

