SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy6.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy6.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy6.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy6.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy6.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy6.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy6.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy6.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy6.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy6.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy6.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy6.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy6.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy6.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy6.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy6.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy6.menu.bodmode.disabled=Disabled/Disabled
atxy6.menu.bodmode.enabled=Enabled/Enabled
atxy6.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy6.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy6.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy6.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy6.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy6.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy6.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy6.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy6.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy6.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy6.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy6.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atxy6.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atxy6.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy6.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy6.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
atxy6.menu.eesave.enable=EEPROM retained
atxy6.menu.eesave.enable.bootloader.eesavebit=1
atxy6.menu.eesave.disable=EEPROM not retained
atxy6.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy6.menu.millis.enabled=Enabled (default timer)
atxy6.menu.millis.disabled=Disabled (saves flash)
atxy6.menu.millis.timera=TCA0 (default on 0-series)
atxy6.menu.millis.timerd=TCD0 (1-series only, default there)
atxy6.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy6.menu.millis.timerb1=TCB1 (3216, 1616, 2-series only)
atxy6.menu.millis.rtc=RTC (no micros)
atxy6.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy6.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy6.menu.millis.disabled.build.millistimer=NONE
atxy6.menu.millis.timera.build.millistimer=A0
atxy6.menu.millis.timerd.build.millistimer=D0
atxy6.menu.millis.timerb0.build.millistimer=B0
atxy6.menu.millis.timerb1.build.millistimer=B1
atxy6.menu.millis.rtc.build.millistimer=RTC
atxy6.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy6.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
atxy6.menu.resetpin.UPDI=UPDI (no reset pin)
atxy6.menu.resetpin.UPDI.bootloader.resetpinbits=01
atxy6.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (2-series only)
atxy6.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy6.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy6.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy6.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy6.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy6.menu.startuptime.8=8ms
atxy6.menu.startuptime.0=0ms
atxy6.menu.startuptime.1=1ms
atxy6.menu.startuptime.2=2ms
atxy6.menu.startuptime.4=4ms
atxy6.menu.startuptime.16=16ms
atxy6.menu.startuptime.32=32ms
atxy6.menu.startuptime.64=64ms
atxy6.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy6.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy6.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy6.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy6.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy6.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy6.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy6.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy6.menu.optimization.size=-Os (size)
#atxy6.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy6.menu.optimization.o3=-O3 (speed)
#atxy6.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy6.menu.optimization.size.build.optimizationlevel=-Os
#atxy6.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy6.menu.optimization.o3.build.optimizationlevel=-O3
#atxy6.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy6.menu.optimization.size.build.optabr=.Os
#atxy6.menu.optimization.sizegcse.build.optabr=.Osng
#atxy6.menu.optimization.o3.build.optabr=.O3
#atxy6.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy6.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy6.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy6.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy6.menu.wiremode.mors.build.wire=MORS
atxy6.menu.wiremode.mands=Master and Slave
atxy6.menu.wiremode.mands.build.wire=MANDS

