SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy6.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy6.menu.printf.full=Full, 2.6k, prints floats
atxy6.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy6.menu.printf.full.build.printfabr=.pfF
atxy6.menu.printf.minimal=Minimal, 1.1k flash used
atxy6.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy6.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy6.menu.PWMmux.A_default=PB0-2, PA3-5, 1-series: PC0/1 (default)
atxy6.menu.PWMmux.default=PB0-2, PA3-5. No TCD PWM even on 1-series.
atxy6.menu.PWMmux.A_buffered=PB0-2 (buffered), 1-series: PC0/1
atxy6.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy6.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy6.menu.PWMmux.U6_A=PB0,1,5, PA3-5, 1-series: PC0/1
atxy6.menu.PWMmux.U6=PB0,1,5, PA3-5. No TCD PWM even on 1-series.
atxy6.menu.PWMmux.U3_D=PB0,1,5 (buffered), 1-series: PA4/5
atxy6.menu.PWMmux.U3_A=PB0,1,5 (buffered), 1-series: PC0/1
atxy6.menu.PWMmux.U3=PB0,1,5 (buffered). No TCD PWM even on 1-series.
atxy6.menu.PWMmux.I6_A=PB3-5 PA3-5, 1-series: PC0/1
atxy6.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
atxy6.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy6.menu.PWMmux.I3_A=PB3-5 (buffered), 1-series: PC0/1
atxy6.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy6.menu.PWMmux.SC6_A=PB3-5, PC3, PA4/5, 1-series: PC0/1
atxy6.menu.PWMmux.SC6=PB3-5, PC3, PA4/5. No TCD PWM even on 1-series.
atxy6.menu.PWMmux.A_default.build.pwmflags=-DUSE_TIMERD0_PWM
atxy6.menu.PWMmux.A_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.U6_A.build.pwmflags=-DTCA_PORTMUX=0x04 -DUSE_TIMERD0_PWM
atxy6.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atxy6.menu.PWMmux.U3_D.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.U3_A.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.I6_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM
atxy6.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy6.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.I3_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy6.menu.PWMmux.SC6_A.build.pwmflags=-DTCA_PORTMUX=0x0F -DUSE_TIMERD0_PWM
atxy6.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atxy6.menu.PWMmux.A_default.build.pwmabr=6A
atxy6.menu.PWMmux.A_buffered.build.pwmabr=3A
atxy6.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy6.menu.PWMmux.buffered.build.pwmabr=3
atxy6.menu.PWMmux.U6_A.build.pwmabr=U6A
atxy6.menu.PWMmux.U6.build.pwmabr=U6
atxy6.menu.PWMmux.U3_D.build.pwmabr=U3D
atxy6.menu.PWMmux.U3_A.build.pwmabr=U3A
atxy6.menu.PWMmux.U3.build.pwmabr=U3
atxy6.menu.PWMmux.I6_A.build.pwmabr=I6A
atxy6.menu.PWMmux.I6.build.pwmabr=I6
atxy6.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy6.menu.PWMmux.I3_A.build.pwmabr=I3A
atxy6.menu.PWMmux.I3.build.pwmabr=I3
atxy6.menu.PWMmux.SC6_A.build.pwmabr=SC6A
atxy6.menu.PWMmux.SC6.build.pwmabr=SC6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy6.menu.attach.allenabled=On all pins, with new implementation.
atxy6.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy6.menu.attach.manual=Only enabled ports
atxy6.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy6.menu.attach.oldversion=Old version, (may fix bugs)
atxy6.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy6.menu.attach.manual.build.attachabr=.aMan
atxy6.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy6.menu.WDTtimeout.disabled=Disabled (recommended)
atxy6.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy6.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy6.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy6.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy6.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy6.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy6.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy6.menu.WDTwindow.disabled=No delay before window "opens"
atxy6.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy6.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy6.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy6.menu.WDTwindow.1second=1 Second before window "opens"
atxy6.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy6.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy6.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy6.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy6.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy6.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy6.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy6.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy6.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy6.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy6.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy6.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy6.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy6.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy6.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy6.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy6.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy6.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy6.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy6.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy6.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
#  Non-bootloader                                                        #
#                                #    #  #     ####   ###  #   #       ###
#  ATtiny3224/1614/1604         ##    #  #     #   #   #   ##  #     #####
#  ATtiny1624/814/804            #    #### === ####    #   # # #   #######
#  ATtiny824/414/404             #       #     #       #   #  ##     #####
#  ATtiny424/214/204            ###      #     #      ###  #   #       ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy4.build.text_section_start=.text=0x0
atxy4.build.millistimer=D0
atxy4.build.board=AVR_ATtinyxy4
atxy4.build.clocksource=0
atxy4.build.core=megatinycore
atxy4.build.mrelax= -mrelax
atxy4.build.variant=txy4
#atxy4.build.optimizationlevel=-Os
atxy4.build.gcse=
atxy4.build.tuned=
atxy4.build.printf=
atxy4.build.wire=MORS
atxy4.build.attachmode=-DCORE_ATTACH_ALL
atxy4.build.mcu=attiny{build.attiny}
atxy4.build.f_cpu={build.speed}000000L
atxy4.build.extra_flags=-DARDUINO_attinyxy4 {build.tuned}
atxy4.build.export_merged_output=false
atxy4.build.pwmflags=

