SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy4.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy4.menu.printf.full=Full, 2.6k, prints floats
atxy4.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy4.menu.printf.full.build.printfabr=.pfF
atxy4.menu.printf.minimal=Minimal, 1.1k flash used
atxy4.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy4.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy4.menu.PWMmux.default=PB0-2, PA3-5 (default)
atxy4.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy4.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy4.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
atxy4.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy4.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy4.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy4.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy4.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy4.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy4.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy4.menu.PWMmux.default.build.pwmabr=6
atxy4.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy4.menu.PWMmux.buffered.build.pwmabr=3
atxy4.menu.PWMmux.I6.build.pwmabr=I6
atxy4.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy4.menu.PWMmux.I3.build.pwmabr=I3

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy4.menu.attach.allenabled=On all pins, with new implementation.
atxy4.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy4.menu.attach.manual=Only enabled ports
atxy4.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy4.menu.attach.oldversion=Old version, (may fix bugs)
atxy4.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy4.menu.attach.manual.build.attachabr=.aMan
atxy4.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy4.menu.WDTtimeout.disabled=Disabled (recommended)
atxy4.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy4.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy4.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy4.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy4.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy4.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy4.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy4.menu.WDTwindow.disabled=No delay before window "opens"
atxy4.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy4.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy4.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy4.menu.WDTwindow.1second=1 Second before window "opens"
atxy4.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy4.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy4.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy4.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
atxy4.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy4.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy4.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy4.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy4.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy4.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy4.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy4.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy4.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy4.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy4.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy4.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy4.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy4.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy4.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy4.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy4.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

############################################################################
#  Non-bootloader                                                          #
#                                     ###      ####   ###  #   #         ###
#  ATtiny412                         #   #     #   #   #   ##  #       #####
#  ATtiny402                          ###  === ####    #   # # #     #######
#  ATtiny212                         #   #     #       #   #  ##       #####
#  ATtiny202                          ###      #      ###  #   #         ###
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy2.build.text_section_start=.text=0x0
atxy2.build.millistimer=D0
atxy2.build.board=AVR_ATtinyxy2
atxy2.build.clocksource=0
atxy2.build.core=megatinycore
atxy2.build.mrelax=
atxy2.build.variant=txy2
atxy2.build.mcu=attiny{build.attiny}
atxy2.build.f_cpu={build.speed}000000L
atxy2.build.extra_flags=-DARDUINO_attinyxy2 {build.tuned}
atxy2.build.export_merged_output=false
#atxy2.build.optimizationlevel=-Os
atxy2.build.gcse=
atxy2.build.tuned=
atxy2.build.printf=
atxy2.build.wire=MORS
atxy2.build.attachmode=-DCORE_ATTACH_ALL
atxy2.build.pwmflags=

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
atxy2.bootloader.WDTCFG=0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2.bootloader.OSCCFG=0x01
atxy2.bootloader.TCD0CFG_avrdude=
atxy2.bootloader.TCD0CFG_serialupdi=
atxy2.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
atxy2.bootloader.APPEND=0x00
atxy2.bootloader.BOOTEND=0x00
atxy2.bootloader.resetpinbits=01
atxy2.bootloader.avrdudestring=
atxy2.bootloader.serialupdistring=-aerase
atxy2.bootloader.tool=avrdude

