SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy2.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy2.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy2.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy2.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy2.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy2.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy2.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy2.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy2.menu.bodmode.disabled=Disabled/Disabled
atxy2.menu.bodmode.enabled=Enabled/Enabled
atxy2.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy2.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy2.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy2.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy2.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy2.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy2.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy2.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy2.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy2.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy2.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy2.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atxy2.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atxy2.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy2.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy2.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# EEPROM RETAIN                          #
#________________________________________#
atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.eesavebit=1
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.eesavebit=0

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy2.menu.millis.enabled=Enabled (default timer)
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.timera=TCA0 (default on 402/202)
atxy2.menu.millis.timerd=TCD0 (412/212 only, default there)
atxy2.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy2.menu.millis.rtc=RTC (no micros)
atxy2.menu.millis.disabled.build.millistimer=NONE
atxy2.menu.millis.timera.build.millistimer=A0
atxy2.menu.millis.timerd.build.millistimer=D0
atxy2.menu.millis.timerb0.build.millistimer=B0
atxy2.menu.millis.rtc.build.millistimer=RTC

#----------------------------------------#
# UPDI/RESET PIN CONFIGURATION           #
#________________________________________#
#Expert mode - if you understand what these mean, uncomment them to enable.
#there are a few lines like this in platform.txt too that can be uncommented to enable for uploads, not just when burning bootloader
#atxy2.menu.resetpin.UPDI=UPDI (no reset pin)
#atxy2.menu.resetpin.UPDI.bootloader.resetpinbits=01
#atxy2.menu.resetpin.reset=Reset (DANGER - Bricks chip w/out HV UPDI programmer!)
#atxy2.menu.resetpin.reset.bootloader.resetpinbits=10
#atxy2.menu.resetpin.gpio=GPIO (DANGER - Bricks chip w/out HV UPDI programmer - Use PCHV)
#atxy2.menu.resetpin.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy2.menu.startuptime.8=8ms
atxy2.menu.startuptime.0=0ms
atxy2.menu.startuptime.1=1ms
atxy2.menu.startuptime.2=2ms
atxy2.menu.startuptime.4=4ms
atxy2.menu.startuptime.16=16ms
atxy2.menu.startuptime.32=32ms
atxy2.menu.startuptime.64=64ms
atxy2.menu.startuptime.0.bootloader.SYSCFG1=0x00
atxy2.menu.startuptime.1.bootloader.SYSCFG1=0x01
atxy2.menu.startuptime.2.bootloader.SYSCFG1=0x02
atxy2.menu.startuptime.4.bootloader.SYSCFG1=0x03
atxy2.menu.startuptime.8.bootloader.SYSCFG1=0x04
atxy2.menu.startuptime.16.bootloader.SYSCFG1=0x05
atxy2.menu.startuptime.32.bootloader.SYSCFG1=0x06
atxy2.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy2.menu.optimization.size=-Os (size)
#atxy2.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy2.menu.optimization.o3=-O3 (speed)
#atxy2.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy2.menu.optimization.size.build.optimizationlevel=-Os
#atxy2.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy2.menu.optimization.o3.build.optimizationlevel=-O3
#atxy2.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy2.menu.optimization.size.build.optabr=.Os
#atxy2.menu.optimization.sizegcse.build.optabr=.Osng
#atxy2.menu.optimization.o3.build.optabr=.O3
#atxy2.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy2.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy2.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy2.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy2.menu.wiremode.mors.build.wire=MORS
atxy2.menu.wiremode.mands=Master and Slave  (412 and 212 only)
atxy2.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy2.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy2.menu.printf.full=Full, 2.6k, prints floats
atxy2.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy2.menu.printf.full.build.printfabr=.pfF
atxy2.menu.printf.minimal=Minimal, 1.1k flash used
atxy2.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy2.menu.printf.minimal.build.printfabr=.pfM

