SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
# The name I3 is used simply to expand what I can test in CI
# because I don't know how to do (IOClass > 2) ? "I3" : "default" in github yaml.
#________________________________________|
atxy2.menu.PWMmux.default=PA1-3,7 (default)
atxy2.menu.PWMmux.buffered=PA1-3 (buffered)
atxy2.menu.PWMmux.I3=PA1-3, PA6/7 (buffered, 1-series only, flash hog)
atxy2.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy2.menu.PWMmux.I3.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy2.menu.PWMmux.buffered.build.pwmabr=3
atxy2.menu.PWMmux.I3.build.pwmabr=3D

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy2.menu.attach.allenabled=On all pins, with new implementation.
atxy2.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy2.menu.attach.manual=Only enabled ports
atxy2.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy2.menu.attach.oldversion=Old version, (may fix bugs)
atxy2.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy2.menu.attach.manual.build.attachabr=.aMan
atxy2.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
atxy2.menu.WDTtimeout.disabled=Disabled (recommended)
atxy2.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
atxy2.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
atxy2.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
atxy2.menu.WDTtimeout.1second=Window remains open for 1 Second
atxy2.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
atxy2.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
atxy2.menu.WDTtimeout.125msec=Window remains open for 125 milliseconds
atxy2.menu.WDTtimeout.63msec=Window remains open for 62.5 milliseconds
atxy2.menu.WDTwindow.disabled=No delay before window "opens"
atxy2.menu.WDTwindow.8seconds=8 Second before window "opens"
atxy2.menu.WDTwindow.4seconds=4 Second before window "opens"
atxy2.menu.WDTwindow.2seconds=2 Second before window "opens"
atxy2.menu.WDTwindow.1second=1 Second before window "opens"
atxy2.menu.WDTwindow.500msec=500 millisecond before window "opens"
atxy2.menu.WDTwindow.250msec=250 millisecond before window "opens"
atxy2.menu.WDTwindow.125msec=125 millisecond before window "opens"
atxy2.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
atxy2.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
atxy2.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
atxy2.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
atxy2.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
atxy2.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
atxy2.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
atxy2.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
atxy2.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
atxy2.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
atxy2.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
atxy2.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
atxy2.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
atxy2.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
atxy2.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
atxy2.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
atxy2.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

############################################################################
#  Non-bootloader                                                          #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####        ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #     #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####    #######
#                   #   #  #  #    # #   #   # #    #  #  #  #         #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #           ###
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
microchip.build.text_section_start=.text=0x0
microchip.build.millistimer=D0
microchip.build.clocksource=0
microchip.build.core=megatinycore
microchip.build.mrelax= -mrelax
microchip.build.variant=txy7
microchip.build.tuned=
microchip.build.board=If you see this, please report this bug promptly. It should never be shown.
microchip.build.printf=
microchip.build.wire=MORS
microchip.build.attachmode=-DCORE_ATTACH_ALL
microchip.build.mcu=attiny{build.attiny}
microchip.build.f_cpu={build.speed}000000L
microchip.build.export_merged_output=false
microchip.build.board=Microchip Placeholder
microchip.build.pwmflags=

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
#________________________________________#
microchip.bootloader.WDTCFG=0b0b{bootloader.wdtwindowbits}{bootloader.wdttimeoutbits}
microchip.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchip.bootloader.OSCCFG=0x01
microchip.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchip.bootloader.TCD0CFG_serialupdi=4:0x00
microchip.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchip.bootloader.APPEND=0x00
microchip.bootloader.BOOTEND=0x00
microchip.bootloader.resetpinbits=01
microchip.bootloader.altreset=Alt reset not supported on 0/1-series.
microchip.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
microchip.build.bootload=
microchip.build.printfabr=
microchip.build.wireabr=
microchip.build.attachabr=
microchip.build.pwmabr=
#microchip.build.optabr=.Os

