SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# printf() version options               #
#________________________________________#
microchip.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
microchip.menu.printf.full=Full, 2.6k, prints floats
microchip.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
microchip.menu.printf.full.build.printfabr=.pfF
microchip.menu.printf.minimal=Minimal, 1.1k flash used
microchip.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
microchip.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
microchip.menu.attach.allenabled=On all pins, with new implementation.
microchip.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
microchip.menu.attach.manual=Only enabled ports
microchip.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
microchip.menu.attach.oldversion=Old version, (may fix bugs)
microchip.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
microchip.menu.attach.manual.build.attachabr=.aMan
microchip.menu.attach.oldversion.build.attachabr=.aOld

#----------------------------------------#
# WDT MODE                               #
#________________________________________#
microchip.menu.WDTtimeout.disabled=Disabled (recommended)
microchip.menu.WDTtimeout.8seconds=Window remains open for 8 Seconds
microchip.menu.WDTtimeout.4seconds=Window remains open for 4 Seconds
microchip.menu.WDTtimeout.2seconds=Window remains open for 2 Seconds
microchip.menu.WDTtimeout.1second=Window remains open for 1 Second
microchip.menu.WDTtimeout.500msec=Window remains open for 500 milliseconds
microchip.menu.WDTtimeout.250msec=Window remains open for 250 milliseconds
microchip.menu.WDTwindow.disabled=No delay before window "opens"
microchip.menu.WDTwindow.8seconds=8 Second before window "opens"
microchip.menu.WDTwindow.4seconds=4 Second before window "opens"
microchip.menu.WDTwindow.2seconds=2 Second before window "opens"
microchip.menu.WDTwindow.1second=1 Second before window "opens"
microchip.menu.WDTwindow.500msec=500 millisecond before window "opens"
microchip.menu.WDTwindow.250msec=250 millisecond before window "opens"
microchip.menu.WDTwindow.125msec=125 millisecond before window "opens"
microchip.menu.WDTwindow.63msec=62.5 millisecond before window "opens"
microchip.menu.WDTtimeout.disabled.bootloader.wdttimeoutbits=0000
microchip.menu.WDTtimeout.8seconds.bootloader.wdttimeoutbits=1011
microchip.menu.WDTtimeout.4seconds.bootloader.wdttimeoutbits=1010
microchip.menu.WDTtimeout.2seconds.bootloader.wdttimeoutbits=1001
microchip.menu.WDTtimeout.1second.bootloader.wdttimeoutbits=1000
microchip.menu.WDTtimeout.500msec.bootloader.wdttimeoutbits=0111
microchip.menu.WDTtimeout.250msec.bootloader.wdttimeoutbits=0110
microchip.menu.WDTtimeout.125msec.bootloader.wdttimeoutbits=0101
microchip.menu.WDTwindow.disabled.bootloader.wdtwindowbits=0000
microchip.menu.WDTwindow.8seconds.bootloader.wdtwindowbits=1011
microchip.menu.WDTwindow.4seconds.bootloader.wdtwindowbits=1010
microchip.menu.WDTwindow.2seconds.bootloader.wdtwindowbits=1001
microchip.menu.WDTwindow.1second.bootloader.wdtwindowbits=1000
microchip.menu.WDTwindow.500msec.bootloader.wdtwindowbits=0111
microchip.menu.WDTwindow.250msec.bootloader.wdtwindowbits=0110
microchip.menu.WDTwindow.125msec.bootloader.wdtwindowbits=0101
microchip.menu.WDTwindow.63msec.bootloader.wdtwindowbits=0100

##########################################################################
##########################################################################
#                                                                        #
#           ###   ####   #####  ###  ####    ###    ###   #####          #
#          #   #  #   #    #     #   #   #  #   #  #   #    #            #
#          #   #  ####     #     #   ####   #   #  #   #    #            #
#          #   #  #        #     #   #   #  #   #  #   #    #            #
#           ###   #        #    ###  ####    ###    ###     #            #
#________________________________________________________________________#
##########################################################################

##########################################################################
#  WITH OPTIBOOT                                                         #
#  0/1-series                    ##   #  #     ####   ###  #   #         #
#                               #  #  #  #     #   #   #   ##  #         #
#  ATtiny3217/1617                #   #### === ####    #   # # #         #
#  ATtiny1607/817                #       #     #       #   #  ##         #
#  ATtiny807/417                ####     #     #      ###  #   #         #
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy7o.build.text_section_start=.text=0x200
atxy7o.build.millistimer=D0
atxy7o.build.bootload=opti
atxy7o.build.board=AVR_ATtinyxy7
atxy7o.build.clocksource=0
atxy7o.build.core=megatinycore
atxy7o.build.mrelax= -mrelax

atxy7o.build.variant=txy7
#atxy7o.build.optimizationlevel=-Os
atxy7o.build.gcse=
atxy7o.build.tuned=
atxy7o.build.printf=
atxy7o.build.wire=MORS
atxy7o.build.attachmode=-DCORE_ATTACH_ALL
atxy7o.build.mcu=attiny{build.attiny}
atxy7o.build.f_cpu={build.speed}000000L
atxy7o.build.extra_flags=-DARDUINO_attinyxy7 -DUSING_OPTIBOOT {build.tuned}
atxy7o.build.export_merged_output=true
atxy7o.build.pwmflags=-DUSE_TIMERD0_PWM

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy7o.bootloader.WDTCFG=0x00
atxy7o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy7o.bootloader.OSCCFG=0x01
atxy7o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy7o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy7o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy7o.bootloader.APPEND=0x00
atxy7o.bootloader.BOOTEND=0x02
atxy7o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy7o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy7o.bootloader.file=optiboot_txyz{bootloader.uartswap}{bootloader.entrycond}.hex
atxy7o.bootloader.tool=avrdude
#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy7o.build.printfabr=
atxy7o.build.attachabr=
atxy7o.build.wireabr=
atxy7o.build.pwmabr=6A
#atxy7o.build.optabr=.Os

