SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
atxy7o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atxy7o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atxy7o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atxy7o.menu.bodvoltage.2v1=2.1V (Unofficial)
atxy7o.menu.bodvoltage.2v9=2.9V (Unofficial)
atxy7o.menu.bodvoltage.3v3=3.3V (Unofficial)
atxy7o.menu.bodvoltage.3v7=3.7V (Unofficial)
atxy7o.menu.bodvoltage.4v0=4.0V (Unofficial)
atxy7o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy7o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atxy7o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy7o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atxy7o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy7o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy7o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy7o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
atxy7o.menu.bodmode.disabled=Disabled/Disabled
atxy7o.menu.bodmode.enabled=Enabled/Enabled
atxy7o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atxy7o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atxy7o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atxy7o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atxy7o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atxy7o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atxy7o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atxy7o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atxy7o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atxy7o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atxy7o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atxy7o.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atxy7o.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atxy7o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atxy7o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atxy7o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atxy7o.menu.millis.enabled=Enabled (default timer)
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.timera=TCA0 (default on 0-series)
atxy7o.menu.millis.timerd=TCD0 (1-series only, default there)
atxy7o.menu.millis.timerb0=TCB0 (breaks tone() and Servo)
atxy7o.menu.millis.timerb1=TCB1 (3217, 1617, 2-series only)
atxy7o.menu.millis.rtc=RTC (no micros)
atxy7o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal (1/2-series only, no micros)
atxy7o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator (1/2-series only, no micros)
atxy7o.menu.millis.disabled.build.millistimer=NONE
atxy7o.menu.millis.timera.build.millistimer=A0
atxy7o.menu.millis.timerd.build.millistimer=D0
atxy7o.menu.millis.timerb0.build.millistimer=B0
atxy7o.menu.millis.timerb1.build.millistimer=B1
atxy7o.menu.millis.rtc.build.millistimer=RTC
atxy7o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atxy7o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
#  UPDI and RESET PIN configuration      #
#----------------------------------------#
atxy7o.menu.resetpinopti.UPDI=UPDI, (default optiboot for 8 sec. after all resets)
atxy7o.menu.resetpinopti.UPDI.bootloader.defaultentrycond=_all8sec
atxy7o.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
atxy7o.menu.resetpinopti.reset=Reset, (default ptiboot for 1 sec. after ext. reset) *DANGER* HV UPDI programmer req'd for reprogramming!
atxy7o.menu.resetpinopti.reset.bootloader.defaultentrycond=_extr
atxy7o.menu.resetpinopti.reset.bootloader.resetpinbits=10
atxy7o.menu.resetpinopti.gpio=(weak) GPIO, (default optiboot for 8 sec. after all resets) *DANGER* HV programmer req'd for reprogramming! (PCHV)
atxy7o.menu.resetpinopti.gpio.bootloader.defaultentrycond=_all8sec
atxy7o.menu.resetpinopti.gpio.bootloader.resetpinbits=00

#----------------------------------------#
# BOOTLOADER Entry Conditions            #
#________________________________________#
atxy7o.menu.entrycond.default=Default (Always enter bootloader 8 second delay - unless UPDI fused as reset, then extrf 1 second)
atxy7o.menu.entrycond.all=Always: Every reset except a WDT reset or BOR w/out POR, 8 second timeout - easy to enter bootloader
atxy7o.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
atxy7o.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
atxy7o.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (assume autoreset, requires UPDI fused as reset).
atxy7o.menu.entrycond.extronly=External reset only: 1 second timeout (assume autoreset, requires UPDI fused as reset)
atxy7o.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (assume manual reset, requires UPDI fused as reset)
atxy7o.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
atxy7o.menu.entrycond.extr.bootloader.entrycond=_extr
atxy7o.menu.entrycond.extronly.bootloader.entrycond=_extronly
atxy7o.menu.entrycond.poronly.bootloader.entrycond=_poronly8sec
atxy7o.menu.entrycond.all.bootloader.entrycond=_all8sec
atxy7o.menu.entrycond.swr.bootloader.entrycond=_swronly8sec
atxy7o.menu.entrycond.extr_slow.bootloader.entrycond=_extr8sec
atxy7o.menu.entrycond.porswr.bootloader.entrycond=_porswr8sec

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atxy7o.menu.startuptimeopti.8=8ms
atxy7o.menu.startuptimeopti.0=0ms
atxy7o.menu.startuptimeopti.1=1ms
atxy7o.menu.startuptimeopti.2=2ms
atxy7o.menu.startuptimeopti.4=4ms
atxy7o.menu.startuptimeopti.16=16ms
atxy7o.menu.startuptimeopti.32=32ms
atxy7o.menu.startuptimeopti.64=64ms
atxy7o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atxy7o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atxy7o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atxy7o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atxy7o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atxy7o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atxy7o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atxy7o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

