SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atxy7o.menu.bootloaderuart.default=TX:9 (PB2), RX:8 (PB3)
atxy7o.menu.bootloaderuart.alternate=TX:18 (PA1), RX:19 (PA2)
atxy7o.menu.bootloaderuart.default.bootloader.uartswap=
atxy7o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy7o.menu.optimization.size=-Os (size)
#atxy7o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy7o.menu.optimization.o3=-O3 (speed)
#atxy7o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy7o.menu.optimization.size.build.optimizationlevel=-Os
#atxy7o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy7o.menu.optimization.o3.build.optimizationlevel=-O3
#atxy7o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy7o.menu.optimization.size.build.optabr=.Os
#atxy7o.menu.optimization.sizegcse.build.optabr=.Osng
#atxy7o.menu.optimization.o3.build.optabr=.O3
#atxy7o.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy7o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy7o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy7o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy7o.menu.wiremode.mors.build.wire=MORS
atxy7o.menu.wiremode.mands=Master and Slave
atxy7o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy7o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy7o.menu.printf.full=Full, 2.6k, prints floats
atxy7o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy7o.menu.printf.full.build.printfabr=.pfF
atxy7o.menu.printf.minimal=Minimal, 1.1k flash used
atxy7o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy7o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy7o.menu.PWMmux.A_default=PB0-2, PA3-5, 1-series: PC0/1 (default)
atxy7o.menu.PWMmux.default=PB0-2, PA3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.A_buffered=PB0-2 (buffered), 1-series: PC0/1
atxy7o.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy7o.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.U6_A=PB0,1,5, PA3-5, 1-series: PC0/1
atxy7o.menu.PWMmux.U6=PB0,1,5, PA3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.C6_D=PB0-2, PC3-5 1-series: PA4/5
atxy7o.menu.PWMmux.C6_A=PB0-2, PC3-5 1-series: PC0/1
atxy7o.menu.PWMmux.C6=PB0-2, PC3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.UC6_D=PB0,1,5, PC3-5, 1-series: PA4/5
atxy7o.menu.PWMmux.UC6_A=PB0,1,5, PC3-5, 1-series: PC0/1
atxy7o.menu.PWMmux.UC6=PB0,1,5, PC3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.U3_D=PB0,1,5 (buffered), 1-series: PA4/5
atxy7o.menu.PWMmux.U3_A=PB0,1,5 (buffered), 1-series: PC0/1
atxy7o.menu.PWMmux.U3=PB0,1,5 (buffered). No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.I6_A=PB3-5 PA3-5, 1-series: PC0/1
atxy7o.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.IC6_D=PB3-5, PC3-5, 1-series: PA4/5
atxy7o.menu.PWMmux.IC6_A=PB3-5, PC3-5, 1-series: PC0/1
atxy7o.menu.PWMmux.IC6=PB3-5, PC3-5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy7o.menu.PWMmux.I3_A=PB3-5 (buffered), 1-series: PC0/1
atxy7o.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.SC6_A=PB3-5, PC3, PA4/5, 1-series: PC0/1
atxy7o.menu.PWMmux.SC6=PB3-5, PC3, PA4/5. No TCD PWM even on 1-series.
atxy7o.menu.PWMmux.A_default.build.pwmflags=-DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.A_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.U6_A.build.pwmflags=-DTCA_PORTMUX=0x04 -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atxy7o.menu.PWMmux.C6_D.build.pwmflags=-DTCA_PORTMUX=0x38 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7o.menu.PWMmux.C6_A.build.pwmflags=-DTCA_PORTMUX=0x38 -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.C6.build.pwmflags=-DTCA_PORTMUX=0x38
atxy7o.menu.PWMmux.UC6_D.build.pwmflags=-DTCA_PORTMUX=0x3C -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7o.menu.PWMmux.UC6_A.build.pwmflags=-DTCA_PORTMUX=0x3C -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.UC6.build.pwmflags=-DTCA_PORTMUX=0x3C
atxy7o.menu.PWMmux.U3_D.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.U3_A.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.I6_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy7o.menu.PWMmux.IC6_D.build.pwmflags=-DTCA_PORTMUX=0x3F -DUSE_TIMERD0_PWM -DTCD_USE_WOAB
atxy7o.menu.PWMmux.IC6_A.build.pwmflags=-DTCA_PORTMUX=0x3F -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.IC6.build.pwmflags=-DTCA_PORTMUX=0x3F
atxy7o.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.I3_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy7o.menu.PWMmux.SC6_A.build.pwmflags=-DTCA_PORTMUX=0x0F -DUSE_TIMERD0_PWM
atxy7o.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atxy7o.menu.PWMmux.A_default.build.pwmabr=6A
atxy7o.menu.PWMmux.default.build.pwmabr=6
atxy7o.menu.PWMmux.A_buffered.build.pwmabr=3A
atxy7o.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy7o.menu.PWMmux.buffered.build.pwmabr=3
atxy7o.menu.PWMmux.U6_A.build.pwmabr=U6A
atxy7o.menu.PWMmux.U6.build.pwmabr=U6
atxy7o.menu.PWMmux.C6_D.build.pwmabr=C6D
atxy7o.menu.PWMmux.C6_A.build.pwmabr=C6A
atxy7o.menu.PWMmux.C6.build.pwmabr=C6
atxy7o.menu.PWMmux.UC6_D.build.pwmabr=UC6D
atxy7o.menu.PWMmux.UC6_A.build.pwmabr=UC6A
atxy7o.menu.PWMmux.UC6.build.pwmabr=UC6
atxy7o.menu.PWMmux.U3_D.build.pwmabr=U3D
atxy7o.menu.PWMmux.U3_A.build.pwmabr=U3A
atxy7o.menu.PWMmux.U3.build.pwmabr=U3
atxy7o.menu.PWMmux.I6_A.build.pwmabr=I6A
atxy7o.menu.PWMmux.I6.build.pwmabr=I6
atxy7o.menu.PWMmux.IC6_D.build.pwmabr=IC6D
atxy7o.menu.PWMmux.IC6_A.build.pwmabr=IC6A
atxy7o.menu.PWMmux.IC6.build.pwmabr=IC6
atxy7o.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy7o.menu.PWMmux.I3_A.build.pwmabr=I3A
atxy7o.menu.PWMmux.I3.build.pwmabr=I3
atxy7o.menu.PWMmux.SC6_A.build.pwmabr=SC6A
atxy7o.menu.PWMmux.SC6.build.pwmabr=SC6

