SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx27o.menu.startuptimeopti.8=8ms
atx27o.menu.startuptimeopti.0=0ms
atx27o.menu.startuptimeopti.1=1ms
atx27o.menu.startuptimeopti.2=2ms
atx27o.menu.startuptimeopti.4=4ms
atx27o.menu.startuptimeopti.16=16ms
atx27o.menu.startuptimeopti.32=32ms
atx27o.menu.startuptimeopti.64=64ms
atx27o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx27o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx27o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx27o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx27o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx27o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx27o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx27o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx27o.menu.bootloaderuart.default=TX:9 (PB2), RX:8 (PB3) (UART0 default pins)
atx27o.menu.bootloaderuart.alternate=TX:18 (PA1), RX:19 (PA2) (UART0 alt pins)
atx27o.menu.bootloaderuart.alternate1=TX:14 (PC2), RX:13 (PC1) (UART1 alt pins)
atx27o.menu.bootloaderuart.default.bootloader.uartswap=
atx27o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx27o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atx27o.menu.optimization.size=-Os (size)
#atx27o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atx27o.menu.optimization.o3=-O3 (speed)
#atx27o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atx27o.menu.optimization.size.build.optimizationlevel=-Os
#atx27o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atx27o.menu.optimization.o3.build.optimizationlevel=-O3
#atx27o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atx27o.menu.optimization.size.build.optabr=.Os
#atx27o.menu.optimization.sizegcse.build.optabr=.Osng
#atx27o.menu.optimization.o3.build.optabr=.O3
#atx27o.menu.optimization.o3gcse.build.optabr=.O3ng
#atx27o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atx27o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx27o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx27o.menu.wiremode.mors.build.wire=MORS
atx27o.menu.wiremode.mands=Master and Slave
atx27o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx27o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx27o.menu.printf.full=Full, 2.6k, prints floats
atx27o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx27o.menu.printf.full.build.printfabr=.pfF
atx27o.menu.printf.minimal=Minimal, 1.1k flash used
atx27o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx27o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atx27o.menu.PWMmux.default=PB0-2, PA3-5 (0/2-series default)
atx27o.menu.PWMmux.buffered=PB0-2 (buffered).
atx27o.menu.PWMmux.U6=PB0,1,5, PA3-5.
atx27o.menu.PWMmux.C6=PB0-2, PC3-5.
atx27o.menu.PWMmux.UC6=PB0,1,5, PC3-5.
atx27o.menu.PWMmux.U3=PB0,1,5 (buffered).
atx27o.menu.PWMmux.I6=PB3-5, PA3-5.
atx27o.menu.PWMmux.IC6=PB3-5, PC3-5.
atx27o.menu.PWMmux.I3=PB3-5 (buffered).
atx27o.menu.PWMmux.SC6=PB3-5, PC3, PA4/5.
atx27o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atx27o.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atx27o.menu.PWMmux.C6.build.pwmflags=-DTCA_PORTMUX=0x38
atx27o.menu.PWMmux.UC6.build.pwmflags=-DTCA_PORTMUX=0x3C
atx27o.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atx27o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atx27o.menu.PWMmux.IC6.build.pwmflags=-DTCA_PORTMUX=0x3F
atx27o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atx27o.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atx27o.menu.PWMmux.default.build.pwmabr=6
atx27o.menu.PWMmux.buffered.build.pwmabr=3
atx27o.menu.PWMmux.U6.build.pwmabr=U6
atx27o.menu.PWMmux.C6.build.pwmabr=C6
atx27o.menu.PWMmux.UC6.build.pwmabr=UC6
atx27o.menu.PWMmux.U3.build.pwmabr=U3
atx27o.menu.PWMmux.I6.build.pwmabr=I6
atx27o.menu.PWMmux.IC6.build.pwmabr=IC6
atx27o.menu.PWMmux.I3.build.pwmabr=I3
atx27o.menu.PWMmux.SC6.build.pwmabr=SC6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx27o.menu.attach.allenabled=On all pins, with new implementation.
atx27o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx27o.menu.attach.manual=Only enabled ports
atx27o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx27o.menu.attach.oldversion=Old version, (may fix bugs)
atx27o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx27o.menu.attach.manual.build.attachabr=.aMan
atx27o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    ##    ###      ####   ###  #   #        ###
#                               #  #  #   #     #   #   #   ##  #        ###
#  ATtiny3216/1616/1606           #   #   # === ####    #   # # #        ###
#  ATtiny816/806                 #    #   #     #       #   #  ##        ###
#  ATtiny416/406                ####   ###      #      ###  #   #        ###
#________________________________________________________________________###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atxy6o.build.text_section_start=.text=0x200
atxy6o.build.millistimer=D0
atxy6o.build.bootload=opti
atxy6o.build.board=AVR_ATtinyxy6
atxy6o.build.clocksource=0
atxy6o.build.core=megatinycore
atxy6o.build.mrelax= -mrelax
atxy6o.build.variant=txy6
#atxy6o.build.optimizationlevel=-Os
atxy6o.build.gcse=
atxy6o.build.tuned=
atxy6o.build.printf=
atxy6o.build.wire=MORS
atxy6o.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.build.mcu=attiny{build.attiny}
atxy6o.build.f_cpu={build.speed}000000L
atxy6o.build.extra_flags=-DARDUINO_attinyxy6 -DUSING_OPTIBOOT {build.tuned}
atxy6o.build.export_merged_output=true
atxy6o.build.pwmflags=-DUSE_TIMERD0_PWM

