SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atxy6o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3)
atxy6o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2)
atxy6o.menu.bootloaderuart.default.bootloader.uartswap=
atxy6o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy6o.menu.optimization.size=-Os (size)
#atxy6o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy6o.menu.optimization.o3=-O3 (speed)
#atxy6o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy6o.menu.optimization.size.build.optimizationlevel=-Os
#atxy6o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy6o.menu.optimization.o3.build.optimizationlevel=-O3
#atxy6o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy6o.menu.optimization.size.build.optabr=.Os
#atxy6o.menu.optimization.sizegcse.build.optabr=.Osng
#atxy6o.menu.optimization.o3.build.optabr=.O3
#atxy6o.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy6o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy6o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy6o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy6o.menu.wiremode.mors.build.wire=MORS
atxy6o.menu.wiremode.mands=Master and Slave
atxy6o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy6o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy6o.menu.printf.full=Full, 2.6k, prints floats
atxy6o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy6o.menu.printf.full.build.printfabr=.pfF
atxy6o.menu.printf.minimal=Minimal, 1.1k flash used
atxy6o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy6o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy6o.menu.PWMmux.A_default=PB0-2, PA3-5, 1-series: PC0/1 (default)
atxy6o.menu.PWMmux.default=PB0-2, PA3-5 (0/2-series default)
atxy6o.menu.PWMmux.3_A_buffered=PB0-2 (buffered), 1-series: PC0/1
atxy6o.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy6o.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.U6_A=PB0,1,5, PA3-5, 1-series: PC0/1
atxy6o.menu.PWMmux.U6=PB0,1,5, PA3-5. No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.U3_D=PB0,1,5 (buffered), 1-series: PA4/5
atxy6o.menu.PWMmux.U3_A=PB0,1,5 (buffered), 1-series: PC0/1
atxy6o.menu.PWMmux.U3=PB0,1,5 (buffered). No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.I6_A=PB3-5 PA3-5, 1-series: PC0/1
atxy6o.menu.PWMmux.I6=PB3-5, PA3-5. No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy6o.menu.PWMmux.I3_A=PB3-5 (buffered), 1-series: PC0/1
atxy6o.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.SC6_A=PB3-5, PC3, PA4/5, 1-series: PC0/1
atxy6o.menu.PWMmux.SC6=PB3-5, PC3, PA4/5. No TCD PWM even on 1-series.
atxy6o.menu.PWMmux.A_default.build.pwmflags=-DUSE_TIMERD0_PWM
atxy6o.menu.PWMmux.3_A_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.U6_A.build.pwmflags=-DTCA_PORTMUX=0x04 -DUSE_TIMERD0_PWM
atxy6o.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atxy6o.menu.PWMmux.U3_D.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.U3_A.build.pwmflags=-DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.I6_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM
atxy6o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy6o.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.I3_A.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy6o.menu.PWMmux.SC6_A.build.pwmflags=-DTCA_PORTMUX=0x0F -DUSE_TIMERD0_PWM
atxy6o.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atxy6o.menu.PWMmux.A_default.build.pwmabr=6A
atxy6o.menu.PWMmux.default.build.pwmabr=6
atxy6o.menu.PWMmux.3_A_buffered.build.pwmabr=3A
atxy6o.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy6o.menu.PWMmux.buffered.build.pwmabr=3
atxy6o.menu.PWMmux.U6_A.build.pwmabr=U6A
atxy6o.menu.PWMmux.U6.build.pwmabr=U6
atxy6o.menu.PWMmux.U3_D.build.pwmabr=U3D
atxy6o.menu.PWMmux.U3_A.build.pwmabr=U3A
atxy6o.menu.PWMmux.U3.build.pwmabr=U3
atxy6o.menu.PWMmux.I6_A.build.pwmabr=I6A
atxy6o.menu.PWMmux.I6.build.pwmabr=I6
atxy6o.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy6o.menu.PWMmux.I3_A.build.pwmabr=I3A
atxy6o.menu.PWMmux.I3.build.pwmabr=I3
atxy6o.menu.PWMmux.SC6_A.build.pwmabr=SC6A
atxy6o.menu.PWMmux.SC6.build.pwmabr=SC6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy6o.menu.attach.allenabled=On all pins, with new implementation.
atxy6o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy6o.menu.attach.manual=Only enabled ports
atxy6o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy6o.menu.attach.oldversion=Old version, (may fix bugs)
atxy6o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy6o.menu.attach.manual.build.attachabr=.aMan
atxy6o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      ##    ###      ####   ###  #   #   ##   ###
#                               #  #  #   #     #   #   #   ##  #   ##   ###
#  ATtiny3226/1626                #   #   # === ####    #   # # #   ##   ###
#  ATtiny826/426                 #    #   #     #       #   #  ##   ##   ###
#                               ####   ###      #      ###  #   #   ##   ###
#___________________________________________________________________##___###

