SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# MILLIS TIMER                           #
#________________________________________#
atx26o.menu.millis.enabled=Enabled (default timer, TCB1)
atx26o.menu.millis.disabled=Disabled (saves flash)
atx26o.menu.millis.timera=TCA0
atx26o.menu.millis.timerb0=TCB0
atx26o.menu.millis.timerb1=TCB1 (default)
atx26o.menu.millis.rtc=RTC (no micros)
atx26o.menu.millis.rtcxtal=RTC w/w32.768 kHz ext. crystal
atx26o.menu.millis.rtcxosc=RTC w/w32.768 kHz ext. oscillator
atx26o.menu.millis.disabled.build.millistimer=NONE
atx26o.menu.millis.timera.build.millistimer=A0
atx26o.menu.millis.timerb0.build.millistimer=B0
atx26o.menu.millis.timerb1.build.millistimer=B1
atx26o.menu.millis.rtc.build.millistimer=RTC
atx26o.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
atx26o.menu.millis.rtcxosc.build.millistimer=RTC_XOSC

#----------------------------------------#
# BODVOLTAGE                             #
#________________________________________#
atx26o.menu.bodvoltage.1v8=1.8V (5 MHz or less)
atx26o.menu.bodvoltage.2v6=2.6V (10 MHz or less)
atx26o.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
atx26o.menu.bodvoltage.2v1=2.1V (Unofficial)
atx26o.menu.bodvoltage.2v9=2.9V (Unofficial)
atx26o.menu.bodvoltage.3v3=3.3V (Unofficial)
atx26o.menu.bodvoltage.3v7=3.7V (Unofficial)
atx26o.menu.bodvoltage.4v0=4.0V (Unofficial)
atx26o.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atx26o.menu.bodvoltage.2v1.bootloader.bodlevbits=001
atx26o.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atx26o.menu.bodvoltage.2v9.bootloader.bodlevbits=011
atx26o.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atx26o.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atx26o.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atx26o.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BODMODE                                #
#________________________________________#
atx26o.menu.bodmode.disabled=Disabled/Disabled
atx26o.menu.bodmode.enabled=Enabled/Enabled
atx26o.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
atx26o.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
atx26o.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
atx26o.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
atx26o.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
atx26o.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
atx26o.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
atx26o.menu.bodmode.disabled.bootloader.BODCFG=0x00
atx26o.menu.bodmode.enabled.bootloader.bodmodebits=00101
atx26o.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
atx26o.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
atx26o.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
atx26o.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
atx26o.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
atx26o.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
atx26o.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
#  UPDI and RESET PIN configuration      #
#----------------------------------------#
atx26o.menu.resetpinopti_2.UPDIaltrst=UPDI on PA0, RST on PB4 (Optiboot for 1 sec after reset)
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.resetpinbits=11
atx26o.menu.resetpinopti_2.UPDIaltrst.bootloader.defaultentrycond=_extr
atx26o.menu.resetpinopti_2.UPDI=No RST, UPDI enabled, 8 sec Optiboot after power on or SW reset
atx26o.menu.resetpinopti_2.UPDI.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx26o.menu.resetpinopti_2.UPDI.bootloader.resetpinbits=01
atx26o.menu.resetpinopti_2.UPDI.bootloader.defaultentrycond=_all8sec
atx26o.menu.resetpinopti_2.reset=RST on PA0, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
atx26o.menu.resetpinopti_2.reset.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx26o.menu.resetpinopti_2.reset.bootloader.resetpinbits=10
atx26o.menu.resetpinopti_2.reset.bootloader.defaultentrycond=_extr
atx26o.menu.resetpinopti_2.gpio=PA0 is GPIO, (default always run optiboot for 8 sec), no RST, no UPDI - *DANGER* HV programmer req'd for reprogramming! (PCHV)
atx26o.menu.resetpinopti_2.gpio.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx26o.menu.resetpinopti_2.gpio.bootloader.resetpinbits=00
atx26o.menu.resetpinopti_2.gpio.bootloader.defaultentrycond=_all8sec

#----------------------------------------#
# BOOTLOADER Entry Conditions            #
#________________________________________#
atx26o.menu.entrycond.default=Default (extr 1 sec if either reset pin enabled, otherwise always, 8 seconds)
atx26o.menu.entrycond.all=Always: Every reset except a WDT reset or BOR w/out POR, 8 second timeout - easy to enter bootloader
atx26o.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
atx26o.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
atx26o.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (assume autoreset, requires UPDI fused as reset).
atx26o.menu.entrycond.extronly=External reset only: 1 second timeout (assume autoreset, requires UPDI fused as reset)
atx26o.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (assume manual reset, requires UPDI fused as reset)
atx26o.menu.entrycond.porswr=POR and SWR, but not external resets.
atx26o.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
atx26o.menu.entrycond.extr.bootloader.entrycond=_extr
atx26o.menu.entrycond.extronly.bootloader.entrycond=_extronly
atx26o.menu.entrycond.poronly.bootloader.entrycond=_poronly8sec
atx26o.menu.entrycond.all.bootloader.entrycond=_all8sec
atx26o.menu.entrycond.swr.bootloader.entrycond=_swronly8sec
atx26o.menu.entrycond.extr_slow.bootloader.entrycond=_extr8sec
atx26o.menu.entrycond.porswr.bootloader.entrycond=_porswr8sec

