SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
atx26o.menu.startuptimeopti.8=8ms
atx26o.menu.startuptimeopti.0=0ms
atx26o.menu.startuptimeopti.1=1ms
atx26o.menu.startuptimeopti.2=2ms
atx26o.menu.startuptimeopti.4=4ms
atx26o.menu.startuptimeopti.16=16ms
atx26o.menu.startuptimeopti.32=32ms
atx26o.menu.startuptimeopti.64=64ms
atx26o.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
atx26o.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
atx26o.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
atx26o.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
atx26o.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
atx26o.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
atx26o.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
atx26o.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# BOOTLOADER UART PINS                   #
#________________________________________#
atx26o.menu.bootloaderuart.default=TX:7 (PB2), RX:6 (PB3) (UART0 default pins)
atx26o.menu.bootloaderuart.alternate=TX:14 (PA1), RX:15 (PA2) (UART0 alt pins)
atx26o.menu.bootloaderuart.alternate1=TX:12 (PC2), RX:11 (PC1) (UART1 alt pins)
atx26o.menu.bootloaderuart.default.bootloader.uartswap=
atx26o.menu.bootloaderuart.alternate.bootloader.uartswap=_alt
atx26o.menu.bootloaderuart.alternate1.bootloader.uartswap=_u1alt

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atx26o.menu.optimization.size=-Os (size)
#atx26o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atx26o.menu.optimization.o3=-O3 (speed)
#atx26o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atx26o.menu.optimization.size.build.optimizationlevel=-Os
#atx26o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atx26o.menu.optimization.o3.build.optimizationlevel=-O3
#atx26o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atx26o.menu.optimization.size.build.optabr=.Os
#atx26o.menu.optimization.sizegcse.build.optabr=.Osng
#atx26o.menu.optimization.o3.build.optabr=.O3
#atx26o.menu.optimization.o3gcse.build.optabr=.O3ng
#atx26o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atx26o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx26o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx26o.menu.wiremode.mors.build.wire=MORS
atx26o.menu.wiremode.mands=Master and Slave
atx26o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx26o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx26o.menu.printf.full=Full, 2.6k, prints floats
atx26o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx26o.menu.printf.full.build.printfabr=.pfF
atx26o.menu.printf.minimal=Minimal, 1.1k flash used
atx26o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx26o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atx26o.menu.PWMmux.default=PB0-2, PA3-5 (0/2-series default)
atx26o.menu.PWMmux.buffered=PB0-2 (buffered).
atx26o.menu.PWMmux.U6=PB0,1,5, PA3-5.
atx26o.menu.PWMmux.U3=PB0,1,5 (buffered).
atx26o.menu.PWMmux.I6=PB3-5, PA3-5.
atx26o.menu.PWMmux.I3=PB3-5 (buffered).
atx26o.menu.PWMmux.SC6=PB3-5, PC3, PA4/5.
atx26o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atx26o.menu.PWMmux.U6.build.pwmflags=-DTCA_PORTMUX=0x04
atx26o.menu.PWMmux.U3.build.pwmflags=-DTCA_BUFFERED_3PIN
atx26o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atx26o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atx26o.menu.PWMmux.SC6.build.pwmflags=-DTCA_PORTMUX=0x0F
atx26o.menu.PWMmux.default.build.pwmabr=6
atx26o.menu.PWMmux.buffered.build.pwmabr=3
atx26o.menu.PWMmux.U6.build.pwmabr=U6
atx26o.menu.PWMmux.U3.build.pwmabr=U3
atx26o.menu.PWMmux.I6.build.pwmabr=I6
atx26o.menu.PWMmux.I3.build.pwmabr=I3
atx26o.menu.PWMmux.SC6.build.pwmabr=SC6

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx26o.menu.attach.allenabled=On all pins, with new implementation.
atx26o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx26o.menu.attach.manual=Only enabled ports
atx26o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx26o.menu.attach.oldversion=Old version, (may fix bugs)
atx26o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx26o.menu.attach.manual.build.attachabr=.aMan
atx26o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                         ###
#  0/1-series                    #    #  #     ####   ###  #   #         ###
#                               ##    #  #     #   #   #   ##  #         ###
#  ATtiny1614/1604               #    #### === ####    #   # # #         ###
#  ATtiny814/804/414             #       #     #       #   #  ##         ###
#  ATtiny404/214/204            ###      #     #      ###  #   #         ###
#________________________________________________________________________###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atxy4o.build.text_section_start=.text=0x200
atxy4o.build.millistimer=D0
atxy4o.build.bootload=opti
atxy4o.build.board=AVR_ATtinyxy4
atxy4o.build.clocksource=0
atxy4o.build.core=megatinycore
atxy4o.build.mrelax= -mrelax
atxy4o.build.variant=txy4
#atxy4o.build.optimizationlevel=-Os
atxy4o.build.gcse=
atxy4o.build.tuned=
atxy4o.build.printf=
atxy4o.build.wire=MORS
atxy4o.build.attachmode=-DCORE_ATTACH_ALL
atxy4o.build.mcu=attiny{build.attiny}
atxy4o.build.f_cpu={build.speed}000000L
atxy4o.build.extra_flags=-DARDUINO_attinyxy4 -DUSING_OPTIBOOT {build.tuned}
atxy4o.build.export_merged_output=true
atxy4o.build.pwmflags=

