SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy4o.bootloader.WDTCFG=0x00
atxy4o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy4o.bootloader.OSCCFG=0x01
atxy4o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy4o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy4o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy4o.bootloader.APPEND=0x00
atxy4o.bootloader.BOOTEND=0x02
atxy4o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy4o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy4o.bootloader.file=optiboot_txyz{bootloader.uartswap}{bootloader.entrycond}.hex
atxy4o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy4o.build.printfabr=
atxy4o.build.attachabr=
atxy4o.build.wireabr=
atxy4o.build.pwmabr=6
#atxy4o.build.optabr=.Os

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy4o.upload.workaround=
atxy4o.upload.tool=avrdude
atxy4o.upload.protocol=arduino
atxy4o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy4o.upload.extra_params=-D -P{serial.port}
atxy4o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.board=AVR_ATtiny1614
atxy4o.menu.chip.1614.build.attiny=1614
atxy4o.menu.chip.1614.upload.maximum_size=15872
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.board=AVR_ATtiny1604
atxy4o.menu.chip.1604.build.attiny=1604
atxy4o.menu.chip.1604.build.millistimer=A0
atxy4o.menu.chip.1604.upload.maximum_size=15872
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.1604.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.1604.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.board=AVR_ATtiny814
atxy4o.menu.chip.814.build.attiny=814
atxy4o.menu.chip.814.upload.maximum_size=7680
atxy4o.menu.chip.814.build.mrelax=
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.board=AVR_ATtiny804
atxy4o.menu.chip.804.build.attiny=804
atxy4o.menu.chip.804.build.millistimer=A0
atxy4o.menu.chip.804.upload.maximum_size=7680
atxy4o.menu.chip.804.build.mrelax=
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.804.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.804.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.board=AVR_ATtiny414
atxy4o.menu.chip.414.build.attiny=414
atxy4o.menu.chip.414.upload.maximum_size=3584
atxy4o.menu.chip.414.build.mrelax=
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.board=AVR_ATtiny404
atxy4o.menu.chip.404.build.attiny=404
atxy4o.menu.chip.404.build.millistimer=A0
atxy4o.menu.chip.404.upload.maximum_size=3584
atxy4o.menu.chip.404.build.mrelax=
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.404.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.404.bootloader.TCD0CFG_serialupdi=
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.board=AVR_ATtiny214
atxy4o.menu.chip.214.build.attiny=214
atxy4o.menu.chip.214.upload.maximum_size=1536
atxy4o.menu.chip.214.build.mrelax=
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.board=AVR_ATtiny204
atxy4o.menu.chip.204.build.attiny=204
atxy4o.menu.chip.204.build.millistimer=A0
atxy4o.menu.chip.204.upload.maximum_size=1536
atxy4o.menu.chip.204.build.mrelax=
atxy4o.menu.chip.204.upload.maximum_data_size=128
atxy4o.menu.chip.204.bootloader.TCD0CFG_avrdude=
atxy4o.menu.chip.204.bootloader.TCD0CFG_serialupdi=

#----------------------------------------#
# CLOCK SOURCE                           #
#________________________________________#
atxy4o.menu.clocko.20internal=20 MHz internal
atxy4o.menu.clocko.16internal=16 MHz internal
atxy4o.menu.clocko.10internal=10 MHz internal
atxy4o.menu.clocko.8internal=8 MHz internal
atxy4o.menu.clocko.5internal=5 MHz internal
atxy4o.menu.clocko.4internal=4 MHz internal
atxy4o.menu.clocko.2internal=2 MHz internal
atxy4o.menu.clocko.1internal=1 MHz internal
atxy4o.menu.clocko.20internaltuned=20 MHz internal - tuned
atxy4o.menu.clocko.16internaltuned=16 MHz internal - tuned
atxy4o.menu.clocko.12internaltuned=12 MHz internal - tuned
atxy4o.menu.clocko.10internaltuned=10 MHz internal - tuned
atxy4o.menu.clocko.8internaltuned=8 MHz internal - tuned
atxy4o.menu.clocko.6internaltuned=6 MHz internal - tuned
atxy4o.menu.clocko.5internaltuned=5 MHz internal - tuned
atxy4o.menu.clocko.4internaltuned=4 MHz internal - tuned
atxy4o.menu.clocko.2internaltuned=2 MHz internal - tuned
atxy4o.menu.clocko.1internaltuned=1 MHz internal - tuned
atxy4o.menu.clocko.20extclock=20 MHz external clock
atxy4o.menu.clocko.16extclock=16 MHz external clock
atxy4o.menu.clocko.12extclock=12 MHz external clock
atxy4o.menu.clocko.10extclock=10 MHz external clock
atxy4o.menu.clocko.8extclock=8 MHz external clock
atxy4o.menu.clocko.24internaltuned=24 MHz internal - tuned, overclocked
atxy4o.menu.clocko.25internaltuned=25 MHz internal - tuned, overclocked
atxy4o.menu.clocko.30internaltuned=30 MHz internal - tuned, overclocked, may be unstable, req. 20 MHz fuse
atxy4o.menu.clocko.32internaltuned=32 MHz internal - tuned, 2-series, overclocked, may be unstable, req. 20 MHz fuse
atxy4o.menu.clocko.24extclock=24 MHz external clock - overclocked
atxy4o.menu.clocko.25extclock=25 MHz external clock - overclocked
atxy4o.menu.clocko.30extclock=30 MHz external clock - overclocked, may be unstable
atxy4o.menu.clocko.32extclock=32 MHz external clock - overclocked, may be unstable
atxy4o.menu.clocko.20internal.build.speed=20
atxy4o.menu.clocko.20internal.build.clocksource=0
atxy4o.menu.clocko.16internal.build.speed=16
atxy4o.menu.clocko.16internal.build.clocksource=0
atxy4o.menu.clocko.10internal.build.speed=10
atxy4o.menu.clocko.10internal.build.clocksource=0
atxy4o.menu.clocko.8internal.build.speed=8
atxy4o.menu.clocko.8internal.build.clocksource=0
atxy4o.menu.clocko.5internal.build.speed=5
atxy4o.menu.clocko.5internal.build.clocksource=0
atxy4o.menu.clocko.4internal.build.speed=4
atxy4o.menu.clocko.4internal.build.clocksource=0
atxy4o.menu.clocko.2internal.build.speed=2
atxy4o.menu.clocko.2internal.build.clocksource=0
atxy4o.menu.clocko.1internal.build.speed=1
atxy4o.menu.clocko.1internal.build.clocksource=0
atxy4o.menu.clocko.20extclock.build.speed=20
atxy4o.menu.clocko.20extclock.build.clocksource=2
atxy4o.menu.clocko.16extclock.build.speed=16
atxy4o.menu.clocko.16extclock.build.clocksource=2
atxy4o.menu.clocko.12extclock.build.speed=12
atxy4o.menu.clocko.12extclock.build.clocksource=2
atxy4o.menu.clocko.10extclock.build.speed=10
atxy4o.menu.clocko.10extclock.build.clocksource=2
atxy4o.menu.clocko.8extclock.build.speed=8
atxy4o.menu.clocko.8extclock.build.clocksource=2
atxy4o.menu.clocko.24extclock.build.speed=24
atxy4o.menu.clocko.24extclock.build.clocksource=2
atxy4o.menu.clocko.25extclock.build.speed=24
atxy4o.menu.clocko.25extclock.build.clocksource=2
atxy4o.menu.clocko.30extclock.build.speed=30
atxy4o.menu.clocko.30extclock.build.clocksource=2
atxy4o.menu.clocko.32extclock.build.speed=32
atxy4o.menu.clocko.32extclock.build.clocksource=2
atxy4o.menu.clocko.1internaltuned.build.speed=1
atxy4o.menu.clocko.1internaltuned.build.clocksource=0
atxy4o.menu.clocko.1internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.2internaltuned.build.speed=2
atxy4o.menu.clocko.2internaltuned.build.clocksource=0
atxy4o.menu.clocko.2internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.4internaltuned.build.speed=4
atxy4o.menu.clocko.4internaltuned.build.clocksource=0
atxy4o.menu.clocko.4internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.5internaltuned.build.speed=5
atxy4o.menu.clocko.5internaltuned.build.clocksource=0
atxy4o.menu.clocko.5internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.5internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.6internaltuned.build.speed=6
atxy4o.menu.clocko.6internaltuned.build.clocksource=0
atxy4o.menu.clocko.6internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.8internaltuned.build.speed=8
atxy4o.menu.clocko.8internaltuned.build.clocksource=0
atxy4o.menu.clocko.8internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.10internaltuned.build.speed=10
atxy4o.menu.clocko.10internaltuned.build.clocksource=0
atxy4o.menu.clocko.10internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.10internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.12internaltuned.build.speed=12
atxy4o.menu.clocko.12internaltuned.build.clocksource=0
atxy4o.menu.clocko.12internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.12internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.16internaltuned.build.speed=16
atxy4o.menu.clocko.16internaltuned.build.clocksource=0
atxy4o.menu.clocko.16internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.20internaltuned.build.speed=20
atxy4o.menu.clocko.20internaltuned.build.clocksource=0
atxy4o.menu.clocko.20internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.20internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.24internaltuned.build.speed=24
atxy4o.menu.clocko.24internaltuned.build.clocksource=0
atxy4o.menu.clocko.24internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.24internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.25internaltuned.build.speed=25
atxy4o.menu.clocko.25internaltuned.build.clocksource=0
atxy4o.menu.clocko.25internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.25internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.30internaltuned.build.speed=30
atxy4o.menu.clocko.30internaltuned.build.clocksource=0
atxy4o.menu.clocko.30internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.30internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.32internaltuned.build.speed=32
atxy4o.menu.clocko.32internaltuned.build.clocksource=0
atxy4o.menu.clocko.32internaltuned.build.tuned=-DCLOCK_TUNE_INTERNAL
atxy4o.menu.clocko.32internaltuned.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.20internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.10internal.bootloader.OSCCFG=0x02
atxy4o.menu.clocko.5internal.bootloader.OSCCFG=0x02

