SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy4o.menu.optimization.size=-Os (size)
#atxy4o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy4o.menu.optimization.o3=-O3 (speed)
#atxy4o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy4o.menu.optimization.size.build.optimizationlevel=-Os
#atxy4o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy4o.menu.optimization.o3.build.optimizationlevel=-O3
#atxy4o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy4o.menu.optimization.size.build.optabr=.Os
#atxy4o.menu.optimization.sizegcse.build.optabr=.Osng
#atxy4o.menu.optimization.o3.build.optabr=.O3
#atxy4o.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy4o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy4o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy4o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy4o.menu.wiremode.mors.build.wire=MORS
atxy4o.menu.wiremode.mands=Master and Slave
atxy4o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy4o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy4o.menu.printf.full=Full, 2.6k, prints floats
atxy4o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy4o.menu.printf.full.build.printfabr=.pfF
atxy4o.menu.printf.minimal=Minimal, 1.1k flash used
atxy4o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy4o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atxy4o.menu.PWMmux.default=PB0-2, PA3-5 (default)
atxy4o.menu.PWMmux.D_buffered=PB0-2 (buffered), 1-series: PA4/5
atxy4o.menu.PWMmux.buffered=PB0-2 (buffered). No TCD PWM even on 1-series.
atxy4o.menu.PWMmux.I6=PB3-5, PA3-5.
atxy4o.menu.PWMmux.I3_D=PB3-5 (buffered), 1-series: PA4/5
atxy4o.menu.PWMmux.I3=PB3-5 (buffered). No TCD PWM even on 1-series.
atxy4o.menu.PWMmux.D_buffered.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy4o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy4o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atxy4o.menu.PWMmux.I3_D.build.pwmflags=-DTCA_PORTMUX=0x07 -DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy4o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atxy4o.menu.PWMmux.default.build.pwmabr=6
atxy4o.menu.PWMmux.D_buffered.build.pwmabr=3D
atxy4o.menu.PWMmux.buffered.build.pwmabr=3
atxy4o.menu.PWMmux.I6.build.pwmabr=I6
atxy4o.menu.PWMmux.I3_D.build.pwmabr=I3D
atxy4o.menu.PWMmux.I3.build.pwmabr=I3

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy4o.menu.attach.allenabled=On all pins, with new implementation.
atxy4o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy4o.menu.attach.manual=Only enabled ports
atxy4o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy4o.menu.attach.oldversion=Old version, (may fix bugs)
atxy4o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy4o.menu.attach.manual.build.attachabr=.aMan
atxy4o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#  WITH OPTIBOOT                                                    ##   ###
#  2-series                      #    #  #     ####   ###  #   #    ##   ###
#                               ##    #  #     #   #   #   ##  #    ##   ###
#  ATtiny3224/1624               #    #### ### ####    #   # # #    ##   ###
#  ATtiny824/424                 #       #     #       #   #  ##    ##   ###
#                               ###      #     #      ###  #   #    ##   ###
#___________________________________________________________________##___###

#----------------------------------------#
# BUILD PARAMETERS                       #
#________________________________________#
atx24o.build.text_section_start=.text=0x200
atx24o.build.millistimer=B1
atx24o.build.bootload=opti
atx24o.build.board=AVR_ATtinyxy4
atx24o.build.clocksource=0
atx24o.build.core=megatinycore
atx24o.build.mrelax= -mrelax
atx24o.build.variant=txy4
#atx24o.build.optimizationlevel=-Os
atx24o.build.gcse=
atx24o.build.tuned=
atx24o.build.printf=
atx24o.build.wire=MORS
atx24o.build.attachmode=-DCORE_ATTACH_ALL
atx24o.build.mcu=attiny{build.attiny}
atx24o.build.f_cpu={build.speed}000000L
atx24o.build.extra_flags=-DARDUINO_attinyx24 -DUSING_OPTIBOOT {build.tuned}
atx24o.build.export_merged_output=true
atx24o.build.pwmflags=

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atx24o.bootloader.WDTCFG=0x00
atx24o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atx24o.bootloader.OSCCFG=0x01
atx24o.bootloader.TCD0CFG_avrdude=
atx24o.bootloader.TCD0CFG_serialupdi=
atx24o.bootloader.SYSCFG0=0b1111{bootloader.resetpinbits}10
atx24o.bootloader.APPEND=0x00
atx24o.bootloader.BOOTEND=0x02
atx24o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atx24o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atx24o.bootloader.file=optiboot_tx2z{bootloader.uartswap}{bootloader.entrycond}.hex
atx24o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atx24o.build.printfabr=
atx24o.build.attachabr=
atx24o.build.wireabr=
atx24o.build.pwmabr=6
#atx24o.build.optabr=.Os

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atx24o.upload.workaround=
atx24o.upload.tool=avrdude
atx24o.upload.protocol=arduino
atx24o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atx24o.upload.extra_params=-D -P{serial.port}
atx24o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
# 14-pin Optiboot 2-series tinyAVR submenus   #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atx24o.menu.chip.3224=ATtiny3224
atx24o.menu.chip.3224.build.board=AVR_ATtiny3224
atx24o.menu.chip.3224.build.attiny=3224
atx24o.menu.chip.3224.upload.maximum_size=32256
atx24o.menu.chip.3224.upload.maximum_data_size=3072
atx24o.menu.chip.1624=ATtiny1624
atx24o.menu.chip.1624.build.board=AVR_ATtiny1624
atx24o.menu.chip.1624.build.attiny=1624
atx24o.menu.chip.1624.upload.maximum_size=15872
atx24o.menu.chip.1624.upload.maximum_data_size=2048
atx24o.menu.chip.824=ATtiny824
atx24o.menu.chip.824.build.board=AVR_ATtiny824
atx24o.menu.chip.824.build.attiny=824
atx24o.menu.chip.824.upload.maximum_size=7680
atx24o.menu.chip.824.build.mrelax=
atx24o.menu.chip.824.upload.maximum_data_size=1024
atx24o.menu.chip.424=ATtiny424
atx24o.menu.chip.424.build.board=AVR_ATtiny424
atx24o.menu.chip.424.build.attiny=424
atx24o.menu.chip.424.upload.maximum_size=3584
atx24o.menu.chip.424.build.mrelax=
atx24o.menu.chip.424.upload.maximum_data_size=512

