SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atx24o.menu.optimization.size=-Os (size)
#atx24o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atx24o.menu.optimization.o3=-O3 (speed)
#atx24o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atx24o.menu.optimization.size.build.optimizationlevel=-Os
#atx24o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atx24o.menu.optimization.o3.build.optimizationlevel=-O3
#atx24o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atx24o.menu.optimization.size.build.optabr=.Os
#atx24o.menu.optimization.sizegcse.build.optabr=.Osng
#atx24o.menu.optimization.o3.build.optabr=.O3
#atx24o.menu.optimization.o3gcse.build.optabr=.O3ng
#atx24o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atx24o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atx24o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atx24o.menu.wiremode.mors.build.wire=MORS
atx24o.menu.wiremode.mands=Master and Slave
atx24o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
atx24o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atx24o.menu.printf.full=Full, 2.6k, prints floats
atx24o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atx24o.menu.printf.full.build.printfabr=.pfF
atx24o.menu.printf.minimal=Minimal, 1.1k flash used
atx24o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atx24o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
atx24o.menu.PWMmux.default=PB0-2, PA3-5 (default)
atx24o.menu.PWMmux.buffered=PB0-2 (buffered).
atx24o.menu.PWMmux.I6=PB3-5, PA3-5.
atx24o.menu.PWMmux.I3=PB3-5 (buffered).
atx24o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atx24o.menu.PWMmux.I6.build.pwmflags=-DTCA_PORTMUX=0x07
atx24o.menu.PWMmux.I3.build.pwmflags=-DTCA_PORTMUX=0x07 -DTCA_BUFFERED_3PIN
atx24o.menu.PWMmux.default.build.pwmabr=6
atx24o.menu.PWMmux.buffered.build.pwmabr=3
atx24o.menu.PWMmux.I6.build.pwmabr=I6
atx24o.menu.PWMmux.I3.build.pwmabr=I3

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atx24o.menu.attach.allenabled=On all pins, with new implementation.
atx24o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atx24o.menu.attach.manual=Only enabled ports
atx24o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atx24o.menu.attach.oldversion=Old version, (may fix bugs)
atx24o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atx24o.menu.attach.manual.build.attachabr=.aMan
atx24o.menu.attach.oldversion.build.attachabr=.aOld

############################################################################
#                                                                          #
#  WITH OPTIBOOT                      ###      ####   ###  #   #           #
#  ATtiny412                         #   #     #   #   #   ##  #           #
#  ATtiny402                          ###  === ####    #   # # #           #
#  ATtiny212                         #   #     #       #   #  ##           #
#  ATtiny202                          ###      #      ###  #   #           #
#__________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
atxy2o.build.text_section_start=.text=0x200
atxy2o.build.millistimer=D0
atxy2o.build.bootload=opti
atxy2o.build.board=AVR_ATtinyxy2
atxy2o.build.clocksource=0
atxy2o.build.core=megatinycore
atxy2o.build.mrelax=
atxy2o.build.variant=txy2
#atxy2o.build.optimizationlevel=-Os
atxy2o.build.gcse=
atxy2o.build.tuned=
atxy2o.build.printf=
atxy2o.build.wire=MORS
atxy2o.build.attachmode=-DCORE_ATTACH_ALL
atxy2o.build.mcu=attiny{build.attiny}
atxy2o.build.f_cpu={build.speed}000000L
atxy2o.build.extra_flags=-DARDUINO_attinyxy2 -DUSING_OPTIBOOT {build.tuned}
atxy2o.build.export_merged_output=true
atxy2o.build.pwmflags=-DTCA_PORTMUX=0x01

#----------------------------------------#
# BOOTLOADING PARAMETERS                 #
#________________________________________#
atxy2o.bootloader.WDTCFG=0x00
atxy2o.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
atxy2o.bootloader.OSCCFG=0x01
atxy2o.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
atxy2o.bootloader.TCD0CFG_serialupdi=4:0x00
atxy2o.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}00
atxy2o.bootloader.APPEND=0x00
atxy2o.bootloader.BOOTEND=0x02
atxy2o.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
atxy2o.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
atxy2o.bootloader.file=optiboot_txy2{bootloader.uartswap}{bootloader.entrycond}.hex
atxy2o.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
atxy2o.build.printfabr=
atxy2o.build.attachabr=
atxy2o.build.wireabr=
atxy2o.build.pwmabr=4
#atxy2o.build.optabr=.Os

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
atxy2o.upload.workaround=
atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
atxy2o.upload.extra_params=-D -P{serial.port}
atxy2o.upload.speed=115200

#^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^#
#  8-pin Optiboot 0/1-series tinyAVR submenus #
#_____________________________________________#
# CHIP                                   #
#________________________________________#
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.board=AVR_ATtiny412
atxy2o.menu.chip.412.build.attiny=412
atxy2o.menu.chip.412.upload.maximum_size=3584
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.board=AVR_ATtiny402
atxy2o.menu.chip.402.build.attiny=402
atxy2o.menu.chip.402.build.millistimer=A0
atxy2o.menu.chip.402.upload.maximum_size=3584
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402.TCD0CFG_avrdude=
atxy2o.menu.chip.402.TCD0CFG_serialupdi=
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.board=AVR_ATtiny212
atxy2o.menu.chip.212.build.attiny=212
atxy2o.menu.chip.212.upload.maximum_size=1536
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.board=AVR_ATtiny202
atxy2o.menu.chip.202.build.attiny=202
atxy2o.menu.chip.202.build.millistimer=A0
atxy2o.menu.chip.202.upload.maximum_size=1536
atxy2o.menu.chip.202.upload.maximum_data_size=128
atxy2o.menu.chip.202.TCD0CFG_avrdude=
atxy2o.menu.chip.202.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.attiny=402
atxy2o.menu.chip.402w.build.board=AVR_ATtiny402
atxy2o.menu.chip.402w.build.millistimer=A0
atxy2o.menu.chip.402w.upload.maximum_size=3584
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.TCD0CFG_avrdude=
atxy2o.menu.chip.402w.TCD0CFG_serialupdi=
atxy2o.menu.chip.402w.upload.workaround=w

