SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#atxy2o.menu.optimization.size=-Os (size)
#atxy2o.menu.optimization.sizegcse=-Os (size, no GCSE)
#atxy2o.menu.optimization.o3=-O3 (speed)
#atxy2o.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#atxy2o.menu.optimization.size.build.optimizationlevel=-Os
#atxy2o.menu.optimization.sizegcse.build.optimizationlevel=-Os
#atxy2o.menu.optimization.o3.build.optimizationlevel=-O3
#atxy2o.menu.optimization.o3gcse.build.optimizationlevel=-O3
#atxy2o.menu.optimization.size.build.optabr=.Os
#atxy2o.menu.optimization.sizegcse.build.optabr=.Osng
#atxy2o.menu.optimization.o3.build.optabr=.O3
#atxy2o.menu.optimization.o3gcse.build.optabr=.O3ng
#atxy2o.menu.optimization.sizegcse.build.gcse=-fno-gcse
#atxy2o.menu.optimization.o3gcse.build.gcse=-fno-gcse

#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
atxy2o.menu.wiremode.mors=Master or Slave (saves flash and RAM)
atxy2o.menu.wiremode.mors.build.wire=MORS
atxy2o.menu.wiremode.mands=Master and Slave (412 and 212 only)
atxy2o.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# PWM Pinning options                    #
#________________________________________#
# The name I3 is used simply to expand what I can test in CI
# because I don't know how to do (IOClass > 2) ? "I3" : "default" in github yaml.
#________________________________________|
atxy2o.menu.PWMmux.default=PA1-3,7 (default)
atxy2o.menu.PWMmux.buffered=PA1-3 (buffered)
atxy2o.menu.PWMmux.I3=PA1-3, PA6/7 (buffered, 1-series only, flash hog)
atxy2o.menu.PWMmux.buffered.build.pwmflags=-DTCA_BUFFERED_3PIN
atxy2o.menu.PWMmux.I3.build.pwmflags=-DUSE_TIMERD0_PWM -DTCD_USE_WOAB -DTCA_BUFFERED_3PIN
atxy2o.menu.PWMmux.buffered.build.pwmabr=3
atxy2o.menu.PWMmux.I3.build.pwmabr=3D

#----------------------------------------#
# printf() version options               #
#________________________________________#
atxy2o.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
atxy2o.menu.printf.full=Full, 2.6k, prints floats
atxy2o.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
atxy2o.menu.printf.full.build.printfabr=.pfF
atxy2o.menu.printf.minimal=Minimal, 1.1k flash used
atxy2o.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
atxy2o.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
atxy2o.menu.attach.allenabled=On all pins, with new implementation.
atxy2o.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
atxy2o.menu.attach.manual=Only enabled ports
atxy2o.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
atxy2o.menu.attach.oldversion=Old version, (may fix bugs)
atxy2o.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
atxy2o.menu.attach.manual.build.attachabr=.aMan
atxy2o.menu.attach.oldversion.build.attachabr=.aOld

##########################################################################
#                                                                        #
# Curiosity Nano    #   # ###  ### ####   ###   ### #  # ### ####      ###
# Xplained Mini     ## ##  #  #    #   # #   # #    #  #  #  #   #   #####
# Xplained Pro      # # #  #  #    ####  #   # #    ####  #  ####  #######
# WITH OPTIBOOT     #   #  #  #    # #   #   # #    #  #  #  #       #####
#                   #   # ###  ### #  ##  ###   ### #  # ### #         ###
#________________________________________________________________________#
#                                        #
# BUILD PARAMETERS                       #
#________________________________________#
microchipo.build.text_section_start=.text=0x200
microchipo.build.board=Microchip Placeholder
microchipo.build.millistimer=D0
microchipo.build.bootload=opti
microchipo.build.clocksource=0
microchipo.build.core=megatinycore
microchipo.build.mcu=attiny{build.attiny}
microchipo.build.mrelax= -mrelax
microchipo.build.f_cpu={build.speed}000000L
microchipo.build.variant=txy7
microchipo.build.tuned=
microchipo.build.printf=
microchipo.build.wire=MORS
microchipo.build.attachmode=-DCORE_ATTACH_ALL
microchipo.build.export_merged_output=false
microchipo.bootloader.avrdudestring=-Uflash:w:{runtime.platform.path}/bootloaders/hex/{bootloader.file}:i
microchipo.bootloader.serialupdistring=-f{runtime.platform.path}/bootloaders/hex/{bootloader.file} -a write
microchipo.bootloader.file={bootloader.basefilename}{bootloader.entrycond}.hex
microchipo.build.pwmflags=

#----------------------------------------#
# BOOTLOADING PARAMETERS (FUSES)         #
# These may be overridden, and often are #
#________________________________________#
microchipo.bootloader.WDTCFG=0x00
microchipo.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
microchipo.bootloader.OSCCFG=0x01
microchipo.bootloader.TCD0CFG_avrdude="-Ufuse4:w:0x00:m"
microchipo.bootloader.TCD0CFG_serialupdi=4:0x00
microchipo.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
microchipo.bootloader.APPEND=0x00
microchipo.bootloader.BOOTEND=0x02
microchipo.bootloader.tool=avrdude

#----------------------------------------#
# Exported hex/lst/map names will        #
# indicate selected options. These       #
# are only to do that, nothing else      #
#________________________________________#
microchipo.build.printfabr=
microchipo.build.wireabr=
microchipo.build.attachabr=
microchipo.build.pwmabr=6
#microchipo.build.optabr=.Os

#----------------------------------------#
# UPLOAD VIA OPTIBOOT                    #
#________________________________________#
microchipo.upload.workaround=
microchipo.upload.tool=avrdude
microchipo.upload.protocol=arduino
microchipo.upload.prog_interlock="ERROR: Upload using programmer is not supported on optiboot boards"
microchipo.upload.extra_params=-D -P{serial.port}
microchipo.upload.speed=115200

