SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# BOD VOLTAGE                            #
#________________________________________#
microchipo.menu.bodvoltage.1v8=1.8V (5 MHz or less)
microchipo.menu.bodvoltage.2v6=2.6V (10 MHz or less)
microchipo.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
microchipo.menu.bodvoltage.2v1=2.1V (Unofficial)
microchipo.menu.bodvoltage.2v9=2.9V (Unofficial)
microchipo.menu.bodvoltage.3v3=3.3V (Unofficial)
microchipo.menu.bodvoltage.3v7=3.7V (Unofficial)
microchipo.menu.bodvoltage.4v0=4.0V (Unofficial)
microchipo.menu.bodvoltage.1v8.bootloader.bodlevbits=000
microchipo.menu.bodvoltage.2v1.bootloader.bodlevbits=001
microchipo.menu.bodvoltage.2v6.bootloader.bodlevbits=010
microchipo.menu.bodvoltage.2v9.bootloader.bodlevbits=011
microchipo.menu.bodvoltage.3v3.bootloader.bodlevbits=100
microchipo.menu.bodvoltage.3v7.bootloader.bodlevbits=101
microchipo.menu.bodvoltage.4v0.bootloader.bodlevbits=110
microchipo.menu.bodvoltage.4v2.bootloader.bodlevbits=111

#----------------------------------------#
# BOD MODE                               #
#________________________________________#
microchipo.menu.bodmode.disabled=Disabled/Disabled
microchipo.menu.bodmode.enabled=Enabled/Enabled
microchipo.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
microchipo.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
microchipo.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
microchipo.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
microchipo.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
microchipo.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
microchipo.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
microchipo.menu.bodmode.disabled.bootloader.BODCFG=0x00
microchipo.menu.bodmode.enabled.bootloader.bodmodebits=00101
microchipo.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
microchipo.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
microchipo.menu.bodmode.sampledfast.bootloader.bodmodebits=01010
microchipo.menu.bodmode.sampledlow.bootloader.bodmodebits=11010
microchipo.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
microchipo.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
microchipo.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

#----------------------------------------#
#  UPDI and RESET PIN configuration      #
#----------------------------------------#
microchipo.menu.resetpin.UPDI=UPDI (no reset pin)
microchipo.menu.resetpin.UPDI.bootloader.resetpinbits=01
microchipo.menu.resetpin.UPDI.bootloader.defaultentrycond=_all8sec
microchipo.menu.resetpin.UPDIaltrst=UPDI w/reset on PB4 (Curiosity 1627 only)
microchipo.menu.resetpin.UPDIaltrst.bootloader.resetpinbits={bootloader.altreset}
microchipo.menu.resetpin.UPDIaltrst.bootloader.defaultentrycond=_extr
# the microchip debuggers are not 12v tolerant so nothing that would need hv programming to reset is supported. And if you cut the straps to debugger, you shouldn't be using this board definition.

#----------------------------------------#
# BOOTLOADER Entry Conditions            #
#________________________________________#
microchipo.menu.entrycond.default=Default (external if reset is enabled on PB5 (Curiosity1627 only), otherwise always, 8 sec)
microchipo.menu.entrycond.all=Always: Every reset except a WDT reset or BOR w/out POR, 8 second timeout - easy to enter bootloader
microchipo.menu.entrycond.poronly= Power On Only: Only when chip is powercycled, 8 second timeout (assume manual unplug)
microchipo.menu.entrycond.swr=SW-only: 8 second timeout (Warning: bad app code won't run the bootloader)
microchipo.menu.entrycond.extr=External (reset pin): Reset pin and SW reset, 1 second timeout (Curiosity1627 only).
microchipo.menu.entrycond.extronly=External reset only: 1 second timeout (Curiosity1627 only).
microchipo.menu.entrycond.extr_slow=External (reset pin), slow: Reset pin and SW reset, 8 second timeout (Curiosity1627 only).
microchipo.menu.entrycond.porswr=POR and SWR, but not external resets.
microchipo.menu.entrycond.default.bootloader.entrycond={bootloader.defaultentrycond}
microchipo.menu.entrycond.extr.bootloader.entrycond=_extr
microchipo.menu.entrycond.extronly.bootloader.entrycond=_extronly
microchipo.menu.entrycond.poronly.bootloader.entrycond=_poronly8sec
microchipo.menu.entrycond.all.bootloader.entrycond=_all8sec
microchipo.menu.entrycond.swr.bootloader.entrycond=_swronly8sec
microchipo.menu.entrycond.extr_slow.bootloader.entrycond=_extr8sec
microchipo.menu.entrycond.porswr.bootloader.entrycond=_porswr8sec

#----------------------------------------#
# STARTUP TIME (SUT)                     #
#________________________________________#
microchipo.menu.startuptime.8=8ms
microchipo.menu.startuptime.0=0ms
microchipo.menu.startuptime.1=1ms
microchipo.menu.startuptime.2=2ms
microchipo.menu.startuptime.4=4ms
microchipo.menu.startuptime.16=16ms
microchipo.menu.startuptime.32=32ms
microchipo.menu.startuptime.64=64ms
microchipo.menu.startuptime.0.bootloader.SYSCFG1=0x00
microchipo.menu.startuptime.1.bootloader.SYSCFG1=0x01
microchipo.menu.startuptime.2.bootloader.SYSCFG1=0x02
microchipo.menu.startuptime.4.bootloader.SYSCFG1=0x03
microchipo.menu.startuptime.8.bootloader.SYSCFG1=0x04
microchipo.menu.startuptime.16.bootloader.SYSCFG1=0x05
microchipo.menu.startuptime.32.bootloader.SYSCFG1=0x06
microchipo.menu.startuptime.64.bootloader.SYSCFG1=0x07

#----------------------------------------#
# OPTIMIZATION OPTIONS                   #
#________________________________________#
#microchipo.menu.optimization.size=-Os (size)
#microchipo.menu.optimization.sizegcse=-Os (size, no GCSE)
#microchipo.menu.optimization.o3=-O3 (speed)
#microchipo.menu.optimization.o3gcse=-O3 (speed, no GCSE)
#microchipo.menu.optimization.size.build.optimizationlevel=-Os
#microchipo.menu.optimization.sizegcse.build.optimizationlevel=-Os
#microchipo.menu.optimization.o3.build.optimizationlevel=-O3
#microchipo.menu.optimization.o3gcse.build.optimizationlevel=-O3
#microchipo.menu.optimization.size.build.optabr=.Os
#microchipo.menu.optimization.sizegcse.build.optabr=.Osng
#microchipo.menu.optimization.o3.build.optabr=.O3
#microchipo.menu.optimization.o3gcse.build.optabr=.O3ng
#microchipo.menu.optimization.sizegcse.build.gcse=-fno-gcse
#microchipo.menu.optimization.o3gcse.build.gcse=-fno-gcse

