SpenceKonde/megaTinyCore/megaavr/boards.txt
#----------------------------------------#
# TWI OPTIONS                            #
#________________________________________#
microchipo.menu.wiremode.mors=Master or Slave (saves flash and RAM)
microchipo.menu.wiremode.mors.build.wire=MORS
microchipo.menu.wiremode.mands=Master and Slave
microchipo.menu.wiremode.mands.build.wire=MANDS

#----------------------------------------#
# printf() version options               #
#________________________________________#
microchipo.menu.printf.default=Default (doesn't print floats, 1.4k flash use)
microchipo.menu.printf.full=Full, 2.6k, prints floats
microchipo.menu.printf.full.build.printf=-Wl,-u,vfprintf -lprintf_flt
microchipo.menu.printf.full.build.printfabr=.pfF
microchipo.menu.printf.minimal=Minimal, 1.1k flash used
microchipo.menu.printf.minimal.build.printf=-Wl,-u,vfprintf -lprintf_min
microchipo.menu.printf.minimal.build.printfabr=.pfM

#----------------------------------------#
# attachInterrupt Mode                   #
#________________________________________#
microchipo.menu.attach.allenabled=On all pins, with new implementation.
microchipo.menu.attach.allenabled.build.attachmode=-DCORE_ATTACH_ALL
microchipo.menu.attach.manual=Only enabled ports
microchipo.menu.attach.manual.build.attachmode=-DCORE_ATTACH_NONE
microchipo.menu.attach.oldversion=Old version, (may fix bugs)
microchipo.menu.attach.oldversion.build.attachmode=-DCORE_ATTACH_OLD
microchipo.menu.attach.manual.build.attachabr=.aMan
microchipo.menu.attach.oldversion.build.attachabr=.aOld
